[
{"className":"Barbarian","level":1,"subclass":{},"subclassOptions":[{"name":"Path of the Berserker","lvlFeatures":[3,6,10,14],"features":[{"name":"Frenzy","description":"You can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When the rage ends you gain one level of exhaustion."},{"name":"Mindless Rage","description":"Beginning at 6th level, you can\u0027t be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage. "},{"name":"Intimidating Presence","description":"Beginning at 10th level, you can use your action to frighten someone with your menacing presence. When you do so, choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you.\n\nIf the creature succeeds on its saving throw, you can\u0027t use this feature on that creature again for 24 hours. "},{"name":"Retaliation","description":"Starting at 14th level, when you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature. "}],"description":"For some barbarians, rage is a means to an end—that end being violence. The Path of the Berserker is a path of untrammeled fury, slick with blood. As you enter the Berserker’s rage, you thrill in the chaos of battle, heedless of your own health or well-being."},{"name":"Path of the Totem Warrior","lvlFeatures":[3,3,6,10,14],"features":[{"name":"Spirit Seeker","description":"Yours is a path that seeks attunement with the natural world, giving you a kinship with beasts. You gain the ability to cast the beast sense and speak with animals spells, but only as rituals."},{"name":"Totem Spirit","description":"At 3rd level, when you adopt this path, you choose a totem spirit and gain its feature. You must make or acquire a physical totem object - an amulet or similar adornment - that incorporates fur or feathers, claws, teeth, or bones of the totem animal. At your option, you also gain minor physical attributes that are reminiscent of your totem spirit. For example, if you have a bear totem spirit, you might be unusually hairy and thick skinned, or if your totem is the eagle your eyes turn bright yellow. Your totem animal might be an animal related to those listed here but more appropriate to your homeland. For example, you could choose a hawk or vulture in place of an eagle.\n\n    Bear: The spirit of the bear makes you tough enough to stand up to any punishment. While raging you have resistance to all damage except psychic damage. The spirit of the bear makes you tough enough to stand up to any punishment.\n    Eagle: The spirit of the eagle makes you into a predator who can weave through the fray with ease. You can use the Dash action as a bonus action on your turn. While you\u0027re raging and aren\u0027t wearing heavy armor other creatures have disadvantage on opportunity attack rolls against you.\n    Wolf: The spirit of the wolf makes you a leader of hunters. While you\u0027re raging, your friends have advantage on melee attack rolls against any creature within 5 feet of you that is hostile to you.\n    Elk: The spirit of the elk makes you extraordinarily swift. While you\u0027re raging and aren\u0027t wearing heavy armor, your walking speed increases by 15 feet.\n    Tiger: The spirit of the tiger empowers your leaps. While raging, you can add 10 feet to your long jump distance and 3 feet to your high jump distance. "},{"name":"Aspect of the Beast","description":"At 6th leveI you gain a magical benefit based on the totem animal of your choice. You can choose the same animal you selected at 3rd level or a different one.\n\n    Bear: You gain the might of a bear. Your carrying capacity (including maximum load and maximum lift) is doubled and you have advantage on Strength checks made to push, pull, lift, or break objects.\n    Eagle: You gain the eyesight of an eagle. You can see up to 1 mile away with no difficulty. You are able to discern even fine details as though looking at something no more than 100 feet away from you. Additionally, dim light doesn\u0027t impose disadvantage on your Wisdom (Perception) checks.\n    Wolf: You gain the hunting sensibilities of a wolf. You can track other creatures while traveling at a fast pace, and you can move stealthily while traveling at a normal pace.\n    Elk: Whether mounted or on foot, your travel pace is doubled, as is the travel pace of up to ten companions while they\u0027re within 60 feet of you and you\u0027re not incapacitated (see chapter 8 in the Player\u0027s Handbook for more information about travel pace). The elk spirit helps you roam far and fast.\n    Tiger: You gain proficiency in two skills from the following list: Athletics, Acrobatics, Stealth, and Survival. The cat spirit hones your survival instincts "},{"name":"Spirit Walker","description":"At 10th level. you can cast the commune with nature spell, but only as a ritual. When you do so, a spiritual version of one of the animals you chose for Totem Spirit or Aspect of the Beast appears to you to convey the information you seek. "},{"name":"Totemic Attunement","description":"At 14th level you gain a magical benefit based on a totem animal of your choice. You can choose the same animal you selected previously or a different one.\n\n    Bear: While you\u0027re raging any creature within 5 feet of you that\u0027s hostile to you has disadvantage on attack rolls against targets other than you or another character with this feature. An enemy is immune to this effect if it can\u0027t see or hear you or if it can\u0027t be frightened.\n    Eagle: While raging you have a flying speed equal to your current walking speed. This benefit works only in short bursts; you fall if you end your turn in the air and nothing else is holding you aloft.\n    Wolf: While you\u0027re raging you can use a bonus action on your turn to knock a Large or smaller creature prone when you hit it with melee weapon attack.\n    Elk: While raging, you can use a bonus action during your move to pass through the space of a Large or smaller creature. That creature must succeed on a Strength saving throw (DC 8 + your Strength bonus + your proficiency bonus) or be knocked prone and take bludgeoning damage equal to 1d12 +your Strength modifier.\n    Tiger: While you\u0027re raging, if you move at least 20 feet in a straight line toward a Large or smaller target right before making a melee weapon attack against it, you can use a bonus action to make an additional melee weapon attack against it. "}],"description":"The Path of the Totem Warrior is a spiritual journey, as the barbarian accepts a spirit animal as guide, protector, and inspiration. In battle, your totem spirit fills you with supernatural might, adding magical fuel to your barbarian rage. It is unusual for an individual to have more than one totem animal spirit, though exceptions exist."}],"hitdice":"1d12","lvlFeatures":[1,1,2,2,5,5,7,9,11,15,18,20],"features":[{"name":"Rage","description":"In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.\n\nWhile raging, you gain the following benefits if you aren\u0027t wearing heavy armor:\n\n    You have advantage on Strength checks and Strength saving throws.\n    When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table.\n    You have resistance to bludgeoning, piercing, and slashing damage. \n\nIf you are able to cast spells, you can\u0027t cast them or concentrate on them while raging.\n\nYour rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven\u0027t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.\n\nOnce you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again. "},{"name":"Unarmored Defense","description":"While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit. "},{"name":"Reckless Attack","description":"Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn. "},{"name":"Danger Sense","description":"At 2nd level, you gain an uncanny sense of when things nearby aren\u0027t as they should be, giving you an edge when you dodge away from danger.\n\nYou have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can\u0027t be blinded, deafened, or incapacitated. "},{"name":"Extra Attack","description":"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. "},{"name":"Fast Movement","description":"Starting at 5th level, your speed increases by 10 feet while you aren\u0027t wearing heavy armor."},{"name":"Feral Instinct","description":"By 7th level, your instincts are so honed that you have advantage on initiative rolls.\n\nAdditionally, if you are surprised at the beginning of combat and aren\u0027t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn. "},{"name":"Brutal Critical","description":"Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack.\n\nThis increases to two additional dice at 13th level and three additional dice at 17th level. "},{"name":"Relentless Rage","description":"Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you\u0027re raging and don\u0027t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.\n\nEach time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10. "},{"name":"Persistant Rage","description":"Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it. "},{"name":"Indomitable Might","description":"Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total. "},{"name":"Primal Champion","description":"At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24. "}]},
{"className":"Bard","level":1,"subclass":{},"subclassOptions":[{"name":"College of Lore","lvlFeatures":[3,3,6,14],"features":[{"name":"Bonus Proficiencies","description":"When you join the College of Lore at 3rd level, you gain proficiency with three skills of your choice. "},{"name":"Cutting Words","description":"Also at 3rd level, you learn how to use your wit to distract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of you makes an Attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses of Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature’s roll. You can choose to use this feature after the creature makes its roll, but before the GM determines whether the Attack roll or ability check succeeds or fails, or before the creature deals its damage. The creature is immune if it can’t hear you or if it’s immune to being Charmed. "},{"name":"Additional Magical Secrets","description":"At 6th level, you learn two Spells of your choice from any class. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen Spells count as bard Spells for you but don’t count against the number of bard Spells you know. "},{"name":"Peerless Skill","description":"Starting at 14th level, when you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check. You can choose to do so after you roll the die for the ability check, but before the GM tells you whether you succeed or fail. "}],"description":"Bards of the College of Lore know something about most things, collecting bits of knowledge from sources as diverse as scholarly tomes and peasant tales. Whether singing folk ballads in taverns or elaborate compositions in royal courts, these bards use their gifts to hold audiences spellbound. When the applause dies down, the audience members might find themselves questioning everything they held to be true, from their faith in the priesthood of the local temple to their loyalty to the king.\n\nThe loyalty of these bards lies in the pursuit of beauty and truth, not in fealty to a monarch or following the tenets of a deity. A noble who keeps such a bard as a herald or advisor knows that the bard would rather be honest than politic. The college’s members gather in libraries and sometimes in actual colleges, complete with classrooms and dormitories, to share their lore with one another. They also meet at festivals or affairs of state, where they can expose corruption, unravel lies, and poke fun at self-important figures of authority. "},{"name":"College of Valor","lvlFeatures":[3,3,6,14],"features":[{"name":"Bonus Proficiencies","description":"When you join the College of Valor at 3rd level, you gain proficiency with medium armor, shields, and martial weapons."},{"name":"Combat Inspiration","description":"Also at 3rd level, you learn to inspire others in battle. A creature that has a Bardic Inspiration die from you can roll that die and add the number rolled to a weapon damage roll it just made. Alternatively, when an attack roll is made against the creature, it can use its reaction to roll the Bardic Inspiration die and add the number rolled to its AC against that attack, after seeing the roll but before knowing whether it hits or misses. "},{"name":"Extra Attack","description":"Starting at 6th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. "},{"name":"Battle Magic","description":"At 14th level, you have mastered the art of weaving spellcasting and weapon use into a single harmonious act. When you use your action to a cast a bard spell, you can make a weapon attack as a bonus action. "}],"description":"Bards of the College of Valor are daring skalds whose tales keep alive the memory of the great heroes of the past, and thereby inspire a new generation of heroes. These bards gather in mead halls or around great bonfires to sing the deeds of the mighty, both past and present. They travel the land to witness great events firsthand and to ensure that the memory of those events doesn\u0027t pass from the world. With their songs, they inspire others to reach the same heights of accomplishment as the heroes of old. "}],"hitdice":"1d8","lvlFeatures":[1,2,2,3,5,6,10,20],"features":[{"name":"Bardic Inspiration","description":"You can inspire others through stirring words or music. To do so, you use a Bonus Action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6.\n\nOnce within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, Attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time.\n\nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a Long Rest. Your Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level. "},{"name":"Jack of All Trades","description":"Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn\u0027t already include your proficiency bonus. "},{"name":"Song of Rest","description":"Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a Short Rest. If you or any friendly creatures who can hear your performance regain hit points by spending Hit Dice at the end of the Short Rest, each of those creatures regains an extra 1d6 hit points. The extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level. "},{"name":"Expertise","description":"At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. At 10th level, you can choose another two skill proficiencies to gain this benefit. "},{"name":"Font of Inspiration","description":"Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or Long Rest. "},{"name":"Countercharm","description":"At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being Frightened or Charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are Incapacitated or silenced or if you voluntarily end it (no action required). "},{"name":"Magical Secrets","description":"By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two Spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip.\n\nThe chosen Spells count as bard Spells for you and are included in the number in the Spells Known column of the Bard table. You learn two additional Spells from any class at 14th level and again at 18th level. "},{"name":"Superior Inspiration","description":"At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use. "}]},
{"className":"Cleric","level":1,"subclass":{},"subclassOptions":[{"name":"Light Domain","lvlFeatures":[1,1,2,6,8,17],"features":[{"name":"Bonus Cantrip","description":"When you choose this domain at 1st level, you gain the light cantrip if you don\u0027t already know it. "},{"name":"Warding Flare","description":"Also at 1st level, you can interpose divine light between yourself and an attacking enemy. When you are attacked by a creature within 30 feet of you that you can see, you can use your reaction to impose disadvantage on the attack roll, causing light to flare before the attacker before it hits or misses. An attacker that can\u0027t be blinded is immune to this feature. You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest. "},{"name":"Channel Divinity: Radiance of the Dawn","description":"Starting at 2nd level, you can use your Channel Divinity to harness sunlight, banishing darkness and dealing radiant damage to your foes. As an action, you present your holy symbol, and any magical darkness within 30 feet of you is dispelled. Additionally, each hostile creature within 30 feet of you must make a Constitution saving throw. A creature takes radiant damage equal to 2d10 + your cleric level on a failed saving throw, and half as much damage on a successful one. A creature that has total cover from you is not affected. "},{"name":"Improved Flare","description":"Starting at 6th level, you can also use your Warding Flare feature when a creature that you can see within 30 feet of you attacks a creature other than you. "},{"name":"Potent Spellcasting","description":"Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip. "},{"name":"Corona of Light","description":"Starting at 17th level, you can use your action to activate an aura of sunlight that lasts for 1 minute or until you dismiss it using another action. You emit bright light in a 60-foot radius and dim light 30 feet beyond that. Your enemies in the bright light have disadvantage on saving throws against any spell that deals fire or radiant damage. "}],"description":"Gods of light—including Helm, Lathander, Pholtus, Branchala, the Silver Flame, Belenus, Apollo, and Re-Horakhty—promote the ideals of rebirth and renewal, truth, vigilance, and beauty, often using the symbol of the sun. Some of these gods are portrayed as the sun itself or as a charioteer who guides the sun across the sky. Others are tireless sentinels whose eyes pierce every shadow and see through every deception. Some are deities of beauty and artistry, who teach that art is a vehicle for the soul\u0027s improvement. Clerics of a god of light are enlightened souls infused with radiance and the power of their gods\u0027 discerning vision, charged with chasing away lies and burning away darkness. "},{"name":"Nature Domain","lvlFeatures":[1,1,2,6,8,17],"features":[{"name":"Bonus Proficiency","description":"Also at 1st level, you gain proficiency with heavy armor. "},{"name":"Acolyte of Nature","description":"At 1st level, you learn one druid cantrip of your choice. You also gain proficiency in one of the following skills of your choice: Animal Handling, Nature, or Survival. "},{"name":"Channel Divinity: Charm Animals and Plants","description":"Starting at 2nd level, you can use your Channel Divinity to charm animals and plants. As an action, you present your holy symbol and invoke the name of your deity. Each beast or plant creature that can see you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is charmed by you for 1 minute or until it takes damage. While it is charmed by you, it is friendly to you and other creatures you designate. "},{"name":"Dampen Elements","description":"Starting at 6th level, when you or a creature within 30 feet of you takes acid, cold, fire, lightning, or thunder damage, you can use your reaction to grant resistance to the creature against that instance of the damage. "},{"name":"Divine Strike","description":"At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 cold, fire, or lightning damage (your choice) to the target. When you reach 14th level, the extra damage increases to 2d8. "},{"name":"Master of Nature","description":"At 17th level, you gain the ability to command animals and plant creatures. While creatures are charmed by your Charm Animals and Plants feature, you can take a bonus action on your turn to verbally command what each of those creatures will do on its next turn. "}],"description":"Gods of nature are as varied as the natural world itself, from inscrutable gods of the deep forests (such as Silvanus, Obad-Hai, Chislev, Balinor, and Pan) to friendly deities associated with particular springs and groves (such as Eldath). Druids revere nature as a whole and might serve one of these deities, practicing mysterious rites and reciting all-but-forgotten prayers in their own secret tongue. But many of these gods have clerics as well, champions who take a more active role in advancing the interests of a particular nature god. These clerics might hunt the evil monstrosities that despoil the woodlands, bless the harvest of the faithful, or wither the crops of those who anger their gods. "},{"name":"Knowledge Domain","lvlFeatures":[1,2,6,8,17],"features":[{"name":"Blessing of Knowledge","description":"At 1st level, you learn two languages of your choice. You also become proficient in your choice of two of the following skills: Arcana, History, Nature, or Religion. Your proficiency bonus is doubled for any ability check you make that uses either of those skills. "},{"name":"Channel Divinity: Knowledge of the Ages","description":"Starting at 2nd level, you can use your Channel Divinity to tap into a divine well of knowledge. As an action, you choose one skill or tool. For 10 minutes, you have proficiency with the chosen skill or tool. "},{"name":"Channel Divinity: Read Thoughts","description":"At 6th level, you can use your Channel Divinity to read a creature’s thoughts. You can then use your access to the creature’s mind to command it. As an action, choose one creature that you can see within 60 feet of you. That creature must make a Wisdom saving throw. If the creature succeeds on the saving throw, you can’t use this feature on it again until you finish a long rest. If the creature fails its save, you can read its surface thoughts (those foremost in its mind, reflecting its current emotions and what it is actively thinking about) when it is within 60 feet of you. This effect lasts for 1 minute. During that time, you can use your action to end this effect and cast the suggestion spell on the creature without expending a spell slot. The target automatically fails its saving throw against the spell. "},{"name":"Potent SpellCasting","description":"Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip. "},{"name":"Visions of the Past","description":"Starting at 17th level, you can call up visions of the past that relate to an object you hold or your immediate surroundings. You spend at least 1 minute in meditation and prayer, then receive dreamlike, shadowy glimpses of recent events. You can meditate in this way for a number of minutes equal to your Wisdom score and must maintain concentration during that time, as if you were casting a spell. Once you use this feature, you can’t use it again until you finish a short or long rest.\n\n    Object Reading. Holding an object as you meditate, you can see visions of the object’s previous owner. After meditating for 1 minute, you learn how the owner acquired and lost the object, as well as the most recent significant event involving the object and that owner. If the object was owned by another creature in the recent past (within a number of days equal to your Wisdom score), you can spend 1 additional minute for each owner to learn the same information about that creature.\n    Area Reading. As you meditate, you see visions of recent events in your immediate vicinity (a room, street, tunnel, clearing, or the like, up to a 50-foot cube), going back a number of days equal to your Wisdom score. For each minute you meditate, you learn about one significant event, beginning with the most recent. Significant events typically involve powerful emotions, such as battles and betrayals, marriages and murders, births and funerals. However, they might also include more mundane events that are nevertheless important in your current situation. "}],"description":"The gods of knowledge; including Oghma, Boccob, Gilean, Aureon, and Thoth; value learning and understanding above all. Some teach that knowledge is to be gathered and shared in libraries and universities, or promote the practical knowledge of craft and invention. Some deities hoard knowledge and keep its secrets to themselves. And some promise their followers that they will gain tremendous power if they unlock the secrets of the multiverse. Followers of these gods study esoteric lore, collect old tomes, delve into the secret places of the earth, and learn all they can. Some gods of knowledge promote the practical knowledge of craft and invention, including smith deities like Gond, Reorx, Onatar, Moradin, Hephaestus, and Goibhniu. "},{"name":"Trickery Domain","lvlFeatures":[1,2,6,8,17],"features":[{"name":"Blessing of the Trickster","description":"Starting when you choose this domain at 1st level, you can use your action to touch a willing creature other than yourself to give it advantage on Dexterity (Stealth) checks. This blessing lasts for 1 hour or until you use this feature again. "},{"name":"Channel Divinity: Invoke Duplicity","description":"Starting at 2nd level, you can use your Channel Divinity to create an illusory duplicate of yourself. As an action, you create a perfect illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The illusion appears in an unoccupied space that you can see within 30 feet of you. As a bonus action on your turn, you can move the illusion up to 30 feet to a space you can see, but it must remain within 120 feet of you.\n\nFor the duration, you can cast spells as though you were in the illusion\u0027s space, but you must use your own senses. Additionally, when both you and your illusion are within 5 feet of a creature that can see the illusion, you have advantage on attack rolls against that creature, given how distracting the illusion is to the target. "},{"name":"Channel Divinity: Cloak of Shadows","description":"Starting at 6th level, you can use your Channel Divinity to vanish. As an action, you become invisible until the end of your next turn. You become visible if you attack or cast a spell. "},{"name":"Divine Strike","description":"At 8th level, you gain the ability to infuse your weapon strikes with poison—a gift from your deity. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage to the target. When you reach 14th level, the extra damage increases to 2d8. "},{"name":"Improved Duplicity","description":"At 17th level, you can create up to four duplicates of yourself, instead of one, when you use Invoke Duplicity. As a bonus action on your turn, you can move any number of them up to 30 feet, to a maximum range of 120 feet. "}],"description":"Gods of trickery—such as Tymora, Beshaba, Olidammara, the Traveler, Garl Glittergold, and Loki—are mischief-makers and instigators who stand as a constant challenge to the accepted order among both gods and mortals. They\u0027re patrons of thieves, scoundrels, gamblers, rebels, and liberators. Their clerics are a disruptive force in the world, puncturing pride, mocking tyrants, stealing from the rich, freeing captives, and flouting hollow traditions. They prefer subterfuge, pranks, deception, and theft rather than direct confrontation. "},{"name":"Life Domain","lvlFeatures":[1,1,2,6,8,17],"features":[{"name":"Bonus Proficiency","description":"When you choose this domain at 1st level, you gain proficiency with Heavy Armor. "},{"name":"Disciple of Life","description":"Also starting at 1st level, your Healing Spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell’s level. "},{"name":"Channel Divinity: Preserve Life","description":"Starting at 2nd level, you can use your Channel Divinity to heal the badly injured. As an action, you present your holy Symbol and evoke Healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can’t use this feature on an Undead or a construct. "},{"name":"Blessed Healer","description":"Beginning at 6th level, the Healing Spells you cast on others heal you as well. When you Cast a Spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell’s level. "},{"name":"Divine Strike","description":"At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon Attack, you can cause the Attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8. "},{"name":"Supreme Healing","description":"Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12. "}],"description":"The Life domain focuses on the vibrant positive energy—one of the fundamental forces of the universe that sustains all life. The gods of life promote vitality and health through Healing the sick and wounded, caring for those in need, and driving away the forces of death and undeath. Almost any non-evil deity can claim influence over this domain, particularly agricultural deities, sun gods, gods of Healing or endurance, and gods of home and community. "},{"name":"War Domain","lvlFeatures":[1,1,2,6,8,17],"features":[{"name":"Bonus Proficiencies","description":"At 1st level, you gain proficiency with martial weapons and heavy armor. "},{"name":"War Priest","description":"From 1st level, your god delivers bolts of inspiration to you while you are engaged in battle. When you use the Attack action, you can make one weapon attack as a bonus action. You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest. "},{"name":"Channel Divinity: Guided Strike","description":"Starting at 2nd level, you can use your Channel Divinity to strike with supernatural accuracy. When you make an attack roll, you can use your Channel Divinity to gain a +10 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the attack hits or misses. "},{"name":"Channel Divinity: War God\u0027s Blessing","description":"At 6th level, when a creature within 30 feet of you makes an attack roll, you can use your reaction to grant that creature a +10 bonus to the roll, using your Channel Divinity. You make this choice after you see the roll, but before the DM says whether the attack hits or misses. "},{"name":"Divine Strike","description":"At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8. "},{"name":"Avatar of Battle","description":"At 17th level, you gain resistance to bludgeoning, piercing, and slashing damage from non-magical weapons. "}],"description":"War has many manifestations. It can make heroes of ordinary people. It can be desperate and horrific, with acts of cruelty and cowardice eclipsing instances of excellence and courage. In either case, the gods of war watch over warriors and reward them for their great deeds. The clerics of such gods excel in battle, inspiring others to fight the good fight or offering acts of violence as prayers. Gods of war include champions of honor and chivalry (such as Torm, Heironeous, and Kiri-Jolith) as well as gods of destruction and pillage (such as Erythnul, the Fury, Gruumsh, and Ares) and gods of conquest and domination (such as Bane, Hextor, and Maglubiyet). Other war gods (such as Tempus, Nike, and Nuada) take a more neutral stance, promoting war in all its manifestations and supporting warriors in any circumstance. "},{"name":"Tempest Domain","lvlFeatures":[1,1,2,6,8,17],"features":[{"name":"Bonus Proficiencies","description":"At 1st level, you gain proficiency with martial weapons and heavy armor. "},{"name":"Wrath of the Storm","description":"Also at 1st level, you can thunderously rebuke attackers. When a creature within 5 feet of you that you can see hits you with an attack, you can use your reaction to cause the creature to make a Dexterity saving throw. The creature takes 2d8 lightning or thunder damage (your choice) on a failed saving throw, and half as much damage on a successful one. You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest. "},{"name":"Channel Divinity: Destructive Wrath","description":"Starting at 2nd level, you can use your Channel Divinity to wield the power of the storm with unchecked ferocity. When you roll lightning or thunder damage, you can use your Channel Divinity to deal maximum damage, instead of rolling. "},{"name":"Thunderbolt Strike","description":"At 6th level, when you deal lightning damage to a Large or smaller creature, you can also push it up to 10 feet away from you. "},{"name":"Divine Strike","description":"At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8. "},{"name":"Stormborn","description":"At 17th level, you have a flying speed equal to your current walking speed whenever you are not underground or indoors. "}],"description":"Gods whose portfolios include the Tempest domain—including Talos, Umberlee, Kord, Zeboim, the Devourer, Zeus, and Thor—govern storms, sea, and sky. They include gods of lightning and thunder, gods of earthquakes, some fire gods, and certain gods of violence, physical strength, and courage. In some pantheons, a god of this domain rules over other deities and is known for swift justice delivered by thunderbolts. In the pantheons of seafaring people, gods of this domain are ocean deities and the patrons of sailors. Tempest gods send their clerics to inspire fear in the common folk, either to keep those folk on the path of righteousness or to encourage them to offer sacrifices of propitiation to ward off divine wrath. "}],"hitdice":"1d8","lvlFeatures":[1,2,5,10],"features":[{"name":"Domain Spells","description":"Each domain has a list of spells-its domain spells-that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn\u0027t count against the number of Spells you can prepare each day. If you have a domain spell that doesn\u0027t appear on the cleric spell list, the spell is nonetheless a cleric spell for you. "},{"name":"Channel Divinity","description":"At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.\n\n    When you use your Channel Divinity, you choose which effect to create. You must then finish a short or Long Rest to use your Channel Divinity again.\n    Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.\n    Beginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or Long Rest, you regain your expended uses. \n\nChannel Divinity: Turn Undead Edit\n\nAs an action, you present your holy Symbol and speak a prayer censuring the Undead. Each Undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.\n\nA turned creature must spend its turns trying to move as far away from you as it can, and it can\u0027t willingly move to a space within 30 feet of you. It also can\u0027t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there\u0027s nowhere to move, the creature can use the Dodge action. "},{"name":"Destroy Undead","description":"Starting at 5th level, when an Undead of CR 1/2 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed. The CR of undead increases as you gain levels.\n\n    5th (CR 1/2 or lower)\n    8th (CR 1 or lower)\n    11th (CR 2 or lower)\n    14th (CR 3 or lower)\n    17th (CR 4 or lower) "},{"name":"Divine Intervention","description":"Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great. Imploring your deity\u0027s aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes.\n\nThe DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can\u0027t use this feature again for 7 days. Otherwise, you can use it again after you finish a Long Rest. At 20th level, your call for intervention succeeds automatically, no roll required. "}]},
{"className":"Druid","level":1,"subclass":{},"subclassOptions":[{"name":"Circle of the Land","lvlFeatures":[2,2,6,10,14],"features":[{"name":"Bonus Cantrip","description":"When you choose this circle at 2nd level, you learn one additional druid cantrip of your choice. "},{"name":"Natural Recovery","description":"Starting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can\u0027t use this feature again until you finish a long rest. "},{"name":"Land\u0027s Stride","description":"Starting at 6th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.\n\nIn addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell. "},{"name":"Nature\u0027s Ward","description":"When you reach 10th level, you can\u0027t be charmed or frightened by elementals or fey, and you are immune to poison and disease. "},{"name":"Nature\u0027s Sanctuary","description":"When you reach 14th level, creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours. The creature is aware of this effect before it makes its attack against you. "}],"description":"The Circle of the Land is made up of mystics and sages who safeguard ancient knowledge and rites through a vast oral tradition. These druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle\u0027s wisest members preside as the chief priests of communities that hold to the Old Faith and serve as advisors to the rulers of those folk. As a member of this circle, your magic is influenced by the land where you were initiated into the circle\u0027s mysterious rites. "},{"name":"Circle of the Moon","lvlFeatures":[2,2,6,10,14],"features":[{"name":"Combat Wild Shape","description":"When you choose this circle at 2nd level, you gain the ability to use Wild Shape on your turn as a bonus action, rather than as an action.\n\nAdditionally, while you are transformed by Wild Shape. You can use a bonus action to expend one spell slot to regain 1d8 hit points per level of the spell slot expended. "},{"name":"Circle Forms","description":"The rites of your circle grant you the ability to transform into more dangerous animal forms. Starting at 2nd level, you can use your Wild Shape to transform into a beast with a challenge rating as high as 1 (you ignore the Max CR column of the Beast Shapes table, but must abide by the other limitations there).\n\nStarting at 6th level, you can transform into a beast with a challenge rating as high as your druid level divided by 3, rounded down. "},{"name":"Primal Strike","description":"Starting at 6th level, your attacks in beast form count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage. "},{"name":"Elemental Wild Shape","description":"At 10th level, you can expend two uses of Wild Shape at the same time to transform into an air elemental, an earth elemental, a fire elemental, or a water elemental. "},{"name":"Thousand Forms","description":"By 14th level, you have learned to use magic to alter your physical form in more subtle ways. You can cast the alter self spell at will "}],"description":"Druids of the Circle of the Moon are fierce guardians of the wilds. Their order gathers under the full moon to share news and trade warnings. They haunt the deepest parts of the wilderness, where they might go for weeks on end before crossing paths with another humanoid creature, let alone another druid.\n\nChangeable as the moon, a druid of this circle might prowl as a great cat one night, soar over the treetops as an eagle the next day, and crash through the undergrowth in bear form to drive off a trespassing monster. The wild is in the druid\u0027s blood. "}],"hitdice":"1d8","lvlFeatures":[2,18,18,20],"features":[{"name":"Wild Shape","description":"Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\n\nYour druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn\u0027t have a flying or swimming speed.\nBeast Shapes Edit\nLevel \tMax CR \tLimitations \tExample\n2nd \t1/4 \tNo flying or swimming speed \tWolf\n4th \t1/2 \tNo flying speed \tCrocodile\n8th \t1 \t\tGiant eagle\n\nYou can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die. While you are transformed, the following rules apply:\n\n    Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature\u0027s bonus instead of yours. If the creature has any legendary or lair actions, you can\u0027t use them.\n    When you transform, you assume the beast\u0027s hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn\u0027t reduce your normal form to 0 hit points, you aren\u0027t knocked unconscious.\n    You can\u0027t cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn\u0027t break your concentration on a spell you\u0027ve already cast, however, or prevent you from taking actions that are part of a spell, such as call lightning, that you\u0027ve already cast.\n    You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can\u0027t use any of your special senses, such as darkvision, unless your new form also has that sense.\n    You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the GM decides whether it is practical for the new form to wear a piece of equipment, based on the creature\u0027s shape and size. Your equipment doesn\u0027t change size or shape to match the new form, and any equipment that the new form can\u0027t wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form. "},{"name":"Timeless Body","description":"Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year. "},{"name":"Beast Spells","description":"Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren\u0027t able to provide material components. "},{"name":"Archdruid","description":"At 20th level, you can use your Wild Shape an unlimited number of times.\n\nAdditionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren\u0027t consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape. "}]},
{"className":"Fighter","level":1,"subclass":{},"subclassOptions":[{"name":"Eldritch Knight","lvlFeatures":[3,3,7,10,15,18],"features":[{"name":"Spellcasting","description":"When you reach 3rd level, you augment your martial prowess with the ability to cast spells. "},{"name":"Weapon Bond","description":"Over the course of 1 hour short rest, you can bond a weapon to you. Once bonded, you cannot be disarmed unless you are incapacitated and if the weapon is on the same plane of existence, you can summon it to your hand as a bonus action. You can bond up to two weapons at once. "},{"name":"War Magic","description":"At level 7, you can use your action to cast a cantrip and make one weapon attack as a bonus action. "},{"name":"Eldritch Strike","description":"At level 10, any creature you hit with a weapon attack has disadvantage on its next save it makes against a spell you cast before the end of your next turn. "},{"name":"Arcane Charge","description":"At level 15, you can teleport up to 30 feet to a space you can see when using your Action Surge. The teleport can take place before or after the Action Surge. "},{"name":"Improved War Magic","description":"At level 18, you can make one weapon attack as a bonus action whenever you use your action to cast a spell. "}],"description":"Those who choose to enhance their melee abilities with magic are the Eldritch Knights. Although their magic ability is limited due to their martial focus, the spells they do know are generally focused on enhancing their damage and adding arcane defenses. "},{"name":"Champion","lvlFeatures":[3,7,10,15,18],"features":[{"name":"Improved Critical","description":"Your weapon attacks score a critical hit on a roll of 19 or 20. "},{"name":"Remarkable Athlete","description":"Starting at the 7th level, you can add half your proficiency bonus (round up) to any Strength, Dexterity or Constitution check you make that doesn\u0027t already use your proficiency bonus. In addition, when you make a running long jump, the distance you can cover increases by a number of feet equal to your Strength modifier, "},{"name":"Additional Fighting Style","description":"At the 10th level, you can choose a second option from the Fighting Style class feature. "},{"name":"Superior Critical","description":"Starting at the 15th level, your weapon attacks score a critical hit on a roll of 18-20 "},{"name":"Survivor","description":"At the 18th level, you attain the pinnacle of resilience in battle. At the start of each of your turns, you regain hit points equal to 5 + your constitution modifier if you have no more than half of your hit points left. You don\u0027t gain this benefit if you have 0 hit points. "}],"description":"The archetypal Champion focuses on the development of raw physical power honed to deadly perfection. Those who model themselves on this archetype combine rigorous training with physical excellence to deal devastating blows. "},{"name":"Battle Master","lvlFeatures":[3,3,7,10,15],"features":[{"name":"Combat Superiority","description":"You learn combat maneuvers empowered by superiority dice.\nManeuvers Edit\n\nYou learn three special maneuvers from the list below. Many maneuvers enhance an attack in some way. You can use only one maneuver per attack.\n\nYou learn two additional maneuvers of your choice at 7th, 10th, and 15th level. Each time you learn new maneuvers, you can also replace one maneuver you know with a different one.\nSuperiority Dice Edit\n\nYou start with 4 superiority dice, which are d8s, and you expend one whenever you use a maneuver. You regain them all when you finish a short or long rest. You gain another superiority die at 7th level and one more at 15th level. \nSaving Throws Edit\n\nIf a maneuver requires a saving throw, the DC is 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).  "},{"name":"Student of War","description":"Your study of the art of war not only in battle but out of it grants you a proficiency in an artisan tool of your choice. "},{"name":"Study Your Enemy","description":"When you reach 7th level, you can spend 1 minute watching your enemy in or out of combat. Doing so gives you information about their abilities. The DM can then tell you if the following enemy abilities are your equal to, stronger, or weaker than your own:\n\n    Strength ability score\n    Dexterity ability score\n    Constitution ability score\n    AC\n    Current HP\n    Total levels (if any)\n    Fighter levels (if any) "},{"name":"Improved Combat Superiority","description":"When you reach 10th level, your superiority dice turn into d10. When you reach level 18, your dice turn into d12. "},{"name":"Relentless","description":"Starting at level 15, whenever you roll for initiative and have zero superiority dice, you get 1 superiority die back. "}],"description":"Battle Masters excel at controlling the battlefield. They specialize in combat maneuvers that distract, goad, and manipulate their enemies with deadly precision. They are well rounded fighters who have a trick for nearly every situation. "}],"hitdice":"1d10","lvlFeatures":[1,1,2,5,9],"features":[{"name":"Fighting Style","description":"At first level, you adopt a particular style of fighting as your specialty. Choose one of the following options.\n\n    Archery. You gain a +2 bonus to attack rolls you make with ranged weapons.\n    Defense. While you are wearing armor, you gain a +1 bonus to AC.\n    Dueling. When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\n    Great Weapon Fighting. When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.\n    Protection. When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.\n    Two-Weapon Fighting. When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.\n    Mariner (UA: Waterborner Adventures): As long as you are not wearing heavy armor or using a shield, you have a swimming speed and a climbing speed equal to your normal speed, and you gain a +1 bonus to AC.\n    Close Quarters Shooter (UA: Light, Dark, Underdark!): You are trained in making ranged attack at close quarters. When making a ranged attack while you are within 5 feet of a hostile creature, you do not have disadvantage on the attack roll. Your ranged attacks ignore half cover and three-quarters cover against targets within 30 feet of you. Finally, you have a +1 bonus to attack rolls on ranged attacks.\n    Tunnel Fighter (UA: Light, Dark, Underdark!): You excel at defending narrow passages, doorways, and other tight spaces. As a bonus action, you can enter a defensive stance that lasts until the start of your next turn. While in your defensive stance, you can make opportunity attacks without using your reaction, and you can use your reaction to make a melee attack against a creature that moves more than 5 feet while within your reach. "},{"name":"Second Wind","description":"At first level, you have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again. "},{"name":"Action Surge","description":"At second level you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action. Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn. "},{"name":"Extra Attack","description":"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class. "},{"name":"Indomitable","description":"Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can’t use this feature again until you finish a long rest. You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level. "}]},
{"className":"Monk","level":1,"subclass":{},"subclassOptions":[{"name":"Way of the Four Elements","lvlFeatures":[3],"features":[{"name":"Disciple of the Elements","description":"When you choose this tradition at 3rd level, you learn magical disciplines that harness the power of the four elements. A discipline requires you to spend ki points each time you use it.\n\nYou know the Elemental Attunement discipline and one other elemental discipline of your choice, which are detailed in the “Elemental Disciplines” section below. You learn one additional elemental discipline of your choice at 6th, 11th, and 17th level.\n\nWhenever you learn a new elemental discipline, you can also replace one elemental discipline that you already know with a different discipline.\nCasting Elemental Spells\n\nSome elemental disciplines allow you to cast spells. See chapter 10 for the general rules of spellcasting. To cast one of these spells, you use its casting time and other rules, but you don’t need to provide material components for it.\n\nOnce you reach 5th level in this class, you can spend additional ki points to increase the level of an elemental discipline spell that you cast, provided that the spell has an enhanced effect at a higher level, as burning hands does. The spell\u0027s level increases by 1 for each additional ki point you spend. For example, if you are a 5th-level monk and use Sweeping Cinder Strike to cast burning hands, you can spend 3 ki points to cast it as a 2nd-level spell (the discipline’s base cost of 2 ki points plus 1)\n\nThe maximum number of ki points you can spend to cast a spell in this way (including its base ki point cost and any additional ki points you spend to increase its level) is determined by your monk level, as shown in the Spells and Ki Points table. \nSpells and Ki Points\nMonk Levels \tMaximum Ki Points for a Spell\n5th-8th \t3\n9th-12th \t4\n13th-16th \t5\n17th-20th \t6\nElemental DisciplinesEdit\n\nThe elemental disciplines are presented in alphabetical order. If a discipline requires a level, you must be that level in this class to learn the discipline.\n\nElemental Attunement.\n\nYou can use your action to briefly control elemental forces nearby, causing one of the following effects of your choice:\n\n    Create a harmless, instantaneous sensory effect related to air, earth, fire, or water, such as a shower of sparks, a puff of wind, a spray of light mist, or a gentle rumbling of stone. \n\n    Instantaneously light or snuff out a candle, a torch, or a small campfire. \n\n    Chill or warm up to 1 pound of nonliving material for up to 1 hour. \n\n    Cause earth, fire, water, or mist that can fit within a 1-foot cube to shape itself into a crude form you designate for 1 minute. \n\nFangs of the Fire Snake.\n\nWhen you use the Attack action on your turn, you can spend 1 ki point to cause tendrils of flame to stretch out from your fists and feet. Your reach with your unarmed strikes increases by 10 feet for that action, as well as the rest of the turn. A hit with such an attack deals fire damage instead of bludgeoning damage, and if you spend 1 ki point when the attack hits, it also deals an extra 1d10 fire damage.\nFist of Four Thunders.\n\nYou can spend 2 ki points to cast thunderwave.\nFist of Unbroken Air.\n\nYou can create a blast of compressed air that strikes like a mighty fist. As an action, you can spend 2 ki points and choose a creature within 30 feet of you. That creature must make a Strength saving throw. On a failed save, the creature takes 3d10 bludgeoning damage, plus an extra 1d10 bludgeoning damage for each additional ki point you spend, and you can push the creature up to 20 feet away from you and knock it prone. On a successful save, the creature takes half as much damage, and you don’t push it or knock it prone.\nRush of the Gale Spirits.\n\nYou can spend 2 ki points to cast gust of wind.\nShape the Flowing River.\n\nAs an action, you can spend 1 ki point to choose an area of ice or water no larger than 30 feet on a side within 120 feet of you. You can change water to ice within the area and vice versa, and you can reshape ice in the area in any manner you choose. You can raise or lower the ice’s elevation, create or fill in a trench, erect or flatten a wall, or form a pillar. The extent of any such changes can’t exceed half the area’s largest dimension. For example, if you affect a 30-foot square, you can create a pillar up to 15 feet high, raise or lower the square’s elevation by up to 15 feet, dig a trench up to 15 feet deep, and so on. You can’t shape the ice to trap or injure a creature in the area.\nSweeping Cinder Strike.\n\nYou can spend 2 ki points to cast burning hands.\nWater Whip.\n\nYou can spend 2 ki points as a action to create a whip of water that shoves and pulls a creature to unbalance it. A creature that you can see that is within 30 feet of you must make a Dexterity saving throw. On a failed save, the creature takes 3d10 bludgeoning damage, plus an extra 1d10 bludgeoning damage for each additional ki point you spend, and you can either knock it prone or pull it up to 25 feet closer to you. On a successful save, the creature takes half as much damage, and you don’t pull it or knock it prone.\nClench of the North Wind (6th Level Required)\n\nYou can spend 3 ki points to cast hold person.\nGong of the Summit (6th Level Required).\n\nYou can spend 3 ki points to cast shatter.\nFlames of the Phoenix (11th Level Required).\n\nYou can spend 4 ki points to cast fireball.\nMist Stance (11th Level Required).\n\nYou can spend 4 ki points to cast gaseous form, targeting yourself.\nRide the Wind (11th Level Required).\n\nYou can spend 4 ki points to cast fly, targeting yourself.\nEternal Mountain Defense (17th Level Required).\n\nYou can spend 5 ki points to cast stoneskin, targeting yourself.\nBreath of Winter (17th Level Required)\n\nYou can spend 6 ki points to cast cone of cold.\nRiver of Hungry Flame (17th Level Required).\n\nYou can spend 5 ki points to cast wall of fire.\nWave of Rolling Earth (17th Level Required).\n\nYou can spend 6 ki points to cast wall of stone.  "}],"description":"You follow a monastic tradition that teaches you to harness the elements. When you focus your ki, you can align yourself with the forces of creation and bend the four elements to your will, using them as an extension of your body. Some members of this tradition dedicate themselves to a single element, but others weave the elements together.\n\nMany monks of this tradition tattoo their bodies with representations of their ki powers, commonly imagined as coiling dragons, but also as phoenixes, fish, plants, mountains, and cresting waves.  "},{"name":"Way of the Open Hand","lvlFeatures":[3,6,11,17],"features":[{"name":"Open Hand Technique","description":"Starting when you choose this tradition at 3rd level, you can manipulate your enemy’s ki when you harness your own. Whenever you hit a creature with one of the attacks granted by your Flurry of Blows, you can impose one of the following effects on that target: \n\n    It must succeed on a Dexterity saving throw or be knocked prone.\n    It must make a Strength saving throw. If it fails, you can push it up to 15 feet away from you.\n    It can’t take reactions until the end of your next turn. "},{"name":"Wholeness of Body","description":"At 6th level, you gain the ability to heal yourself. As an action, you can regain hit points equal to three times your monk level. You must finish a long rest before you can use this feature again. "},{"name":"Tranquility","description":"Beginning at 11th level, you can enter a special meditation that surrounds you with an aura of peace. At the end of a long rest, you gain the effect of a sanctuary spell that lasts until the start of your next long rest (the spell can end early as normal). The saving throw DC for the spell equals 8 + your Wisdom modifier + your proficiency bonus. "},{"name":"Quivering Palm","description":"At 17th level, you gain the ability to set up lethal vibrations in someone’s body. When you hit a creature with an unarmed strike, you can spend 3 ki points to start these imperceptible vibrations, which last for a number of days equal to your monk level. The vibrations are harmless unless you use your action to end them. To do so, you and the target must be on the same plane of existence. When you use this action, the creature must make a Constitution saving throw. If it fails, it is reduced to 0 hit points. If it succeeds, it takes 10d10 necrotic damage.\n\nYou can have only one creature under the effect of this feature at a time. You can choose to end the vibrations harmlessly without using an action.  "}],"description":"Monks of the Way of the Open Hand are the ultimate masters of martial arts combat, whether armed or unarmed. They learn techniques to push and trip their opponents, manipulate ki to heal damage to their bodies, and practice advanced meditation that can protect them from harm.  "},{"name":"Way of the Shadow","lvlFeatures":[3,6,11,17],"features":[{"name":"Shadow Arts","description":"Starting when you choose this tradition at 3rd level, you can use your ki to duplicate the effects of certain spells. As an action, you can spend 2 ki points to cast darkness, darkvision, pass without trace, or silence, without providing material components. Additionally, you gain the minor illusion cantrip if you don’t already know it. "},{"name":"Shadow Step","description":"At 6th level, you gain the ability to step from one shadow into another. When you are in dim light or darkness, as a bonus action you can teleport up to 60 feet to an unoccupied space you can see that is also in dim light or darkness. You then have advantage on the first melee attack you make before the end of the turn. "},{"name":"Cloak of the Shadows","description":"By 11th level, you have learned to become one with the shadows. When you are in an area of dim light or darkness, you can use your action to become invisible. You remain invisible until you make an attack, cast a spell, or are in an area of bright light.  "},{"name":"Opportunist","description":"At 17th level, you can exploit a creature\u0027s momentary distraction when it is hit by an attack. Whenever a creature within 5 feet of you is hit by an attack made by a creature other than you, you can use your reaction to make a melee attack against that creature.  "}],"description":"Monks of the Way of Shadow follow a tradition that values stealth and subterfuge. These monks might be called ninjas or shadowdancers, and they serve as spies and assassins. Sometimes the members of a ninja monastery are family members, forming a clan sworn to secrecy about their arts and missions. Other monasteries are more like thieves’ guilds, hiring out their services to nobles, rich merchants, or anyone else who can pay their fees. Regardless of their methods, the heads of these monasteries expect the unquestioning obedience of their students. "}],"hitdice":"1d8","lvlFeatures":[1,1,2,2,3,4,5,5,6,7,7,10,13,14,15,18,20],"features":[{"name":"Unarmored Defense","description":"     At 1st level, if you wear no armor nor shield your AC is 10+DEX mod+WIS mod, this is lost and replaced by the normal armor AC and shield bonus if you equip armor or a shield. "},{"name":"Martial Arts","description":"You have mastery over unarmed combat and certain types of weapons called Monk weapons which are short swords or any simple melee weapon that does not have the Heavy or Two-Handed property. You gain the following benefits while you are not using armor, nor shield, and only using monk weapons or are unarmed.\n\n    You can use your DEX modifier instead of the STR modifier for attacks and damage rolls while using unarmed strikes or your monk weapon.\n    Your unarmed strikes deal 1d4 damage, this d4 changes as you gain monk levels: to a d6 at level 5, to a d8 at level 11 and to a d10 at level 17. You also can use this die to replace your monk weapon strike damage.\n    When you use your attack action to use your monk weapon or an unarmed strike, you can use your bonus action to deal an additional unarmed strike, if you have not used your bonus action yet. \n\nCertain monasteries use monk weapons in their training. These weapons are simple weapons with an Asian martial arts weapons inspiration. You can choose any simple weapon from the weapon table [PHB] and use it as a monk weapon, for example: you can wield a Nunchaku which is two wood sticks conected by a chain. (Here you use the club stats, but it works as a monk weapon for you; while the club normally deals 1d4 bludgeoning damage and the strength mod, when you reach level 5, with your martial arts you can use your Dexterity modifier, and a d6 to deal the damage with your Nunchaku).\n\nFeel free to ask your DM what kind of weapon you want to use. Monk weapons examples: a Kodachi (a curved short sword like a small katana and uses short sword stats), a Kunai (a small black knife that can be thrown which also has a small hole at the bottom of the handle indicating it can be used to fix it to a chain and uses dagger stats), a Guandao (a Chinese polearm; a staff with a blade on one end, sometimes has a piece of cloth affixed to the blade, you can use Quarterstaff stats with slashing damage instead of bludgeoning). "},{"name":"Ki","description":"Starting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have, as shown in the Ki Points column of the Monk table, You can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind, You learn more ki features as you gain levels in this class, When you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points, Some of your ki features require your target to make a saving throw to resist the feature\u0027s effects. The saving throw DC is calculated as follows:\n\nKi save DC \u003d 8 + your proficiency bonus + your Wisdom modifier\nFlurry of Blows Edit\n\nImmediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action.\nPatient Defense Edit\n\nYou can spend 1 ki point to take the Dodge action as a bonus action on your turn.\nStep of the Wind Edit\n\nYou can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn. "},{"name":"Unarmored Movement","description":"Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table. (Lvl 2 +10, Lvl 6 +15, Lvl 10 +20, Lvl 14 +25, and Lvl 18 +30)\n\nAt 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move. "},{"name":"Deflect Missiles","description":"Starting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level.\n\nIf you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack. "},{"name":"Slow Fall","description":"Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level. "},{"name":"Extra Attack","description":"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. "},{"name":"Stunning Strike","description":"Starting at 5th level, you can interfere with the flow of ki in an opponent’s body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn. "},{"name":"Ki - Empowered Strikes","description":"Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to non-magical attacks and damage. "},{"name":"Evasion","description":"At 7th level, your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon’s lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail. "},{"name":"Stillness of Mind","description":"Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened. "},{"name":"Purity of Body","description":"At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison. "},{"name":"Tongue of the Sun and Moon","description":"Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say. "},{"name":"Diamond Soul","description":"Beginning at 14th level, your mastery of ki grants you proficiency in all saving throws. Additionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result. "},{"name":"Timeless Body","description":"At 15th level, your ki sustains you so that you suffer none of the frailty of old age, and you can\u0027t be aged magically. You can still die of old age, however. In addition, you no longer need food or water. "},{"name":"Empty Body","description":"Beginning at 18th level, you can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage. Additionally, you can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can’t take any other creatures with you. "},{"name":"Perfect Self","description":"At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points. "}]},
{"className":"Paladin","level":1,"subclass":{},"subclassOptions":[{"name":"Oath of Vengeance","lvlFeatures":[3,7,15,20],"features":[{"name":"Channel Divinity","description":"When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\n    Abjure Enemy: As an action, you present your holy symbol and speak a prayer of denunciation, using your Channel Divinity. Choose one creature within 60 feet of you that you can see. That creature must make a Wisdom saving throw, unless it is immune to being frightened. Fiends and undead have disadvantage on this saving throw. On a failed save, the creature is frightened for 1 minute or until It takes any damage. While frightened,the creature\u0027s speed is 0, and It can\u0027t benefit from any bonus to its speed. On a successful save, the creature\u0027s speed is halved for 1 minute or until the creature takes any damage.\n    Vow of Enmity: As a bonus action, you can utter a vow of enmity against a creature you can see within 10 feet of you, using your Channel Divinity. You gain advantage on attack rolls against the creature for 1 minute or until it drops to 0 hit points or falls unconscious. "},{"name":"Relentless Avenger","description":"By 7th level, your supernatural focus helps you close off a foe\u0027s retreat. When you hit a creature with an opportunity attack, you can move up to half your speed immediately after the attack and as part of the same reaction. This movement doesn\u0027t provoke opportunity attacks. "},{"name":"Soul of Vengeance","description":"Starting at 15th level, the authority with which you speak your Vow of Enmity gives you greater power over your foe. When a creature under the effect of your Vow of Enmity makes an attack, you can use your reaction to make a melee weapon attack against that creature if it is within range. "},{"name":"Avenging Angel","description":"At 20th level, you can assume the form of an angelic avenger. Using your action, you undergo a transformation.\n\nFor 1 hour, you gain the following benefits:\n\n    Wings sprout from your back and grant you a flying speed of 60 feet.\n    You emanate an aura of menace in a 30-foot radius. The first time any enemy creature enters the aura or starts its turn there during a battle, the creature must succeeded on a Wisdom saving throw or become frightened of you for 1 minute or until it takes any damage. Attack rolls against the frightened creature have advantage. \n\nOnce you use this feature, you can\u0027t use it again until you finish a long rest "}],"description":"The Oath of Vengeance is a solemn commitment to punish those who have committed a grievous sin. When evil forces slaughter helpless villagers, when an entire people turns against the will of the gods, when a thieves\u0027 guild grows too violent and powerful, when a dragon rampages through the countryside—at times like these, paladins arise and swear an Oath of Vengeance to set right that which has gone wrong. To these paladins—sometimes called avengers or dark knights—their own purity is not as important as delivering justice. "},{"name":"Oath of Devotion","lvlFeatures":[3,7,15,20],"features":[{"name":"Channel Divinity","description":"When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\n    Sacred Weapon: As an action, you can imbue one weapon that you are holding with positive energy, using your Channel Divinity. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (with a minimum bonus of +1).The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. if the weapon is not already magical, it becomes magical for the duration. You can end this effect on your turn as part of any other action. If you are no longer holding or carrying this weapon, or if you fall unconscious, this effect ends.\n    Turn the Unholy: As an action, you present your holy symbol and speak a prayer censuring fiends and undead, using your Channel Divinity. Each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage. A turned creature must spend its turns trying to move as far away from you as it can, and it can\u0027t willingly move to a space within 30 feet of you. It also can\u0027t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there\u0027s nowhere to move, the creature can use the Dodge action. "},{"name":"Aura of Devotion","description":"Starting at 7th level, you and friendly creatures within 10 feet of you can\u0027t be charmed while you are conscious. At 18th level, the range of this aura increases to 30 feet. "},{"name":"Purity of Spirit","description":"Beginning at 15th level, you are always under the effects of a protection from evil and good spell. "},{"name":"Holy Nimbus","description":"At 20th level, as an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that. Whenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage. In addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead. Once you use this feature, you can\u0027t use it again until you finish a long rest. "}],"description":"The Oath of Devotion binds a paladin to the loftiest ideals of justice, virtue, and order. Sometimes called cavaliers, white knights, or holy warriors, these paladins meet the ideal of the knight in shining armor. Acting with honor in pursuit of justice and the greater good, they hold themselves to the highest standards of conduct, and some—for better or worse—hold the rest of the world to the same standards. Many who swear this oath are devoted to gods of law and good and use their gods\u0027 tenets as the measure of their devotion. They hold angels—the perfect servants of good—as their ideals, and incorporate images of angelic wings into their helmets or coats of arms. "},{"name":"Oath of the Ancients","lvlFeatures":[3,7,15,20],"features":[{"name":"Channel Divinity","description":"When you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\n    Nature\u0027s Wrath: You can use your Channel Divinity to invoke primeval forces to ensnare a foe. As an action, you can cause spectral vines to spring up and reach for a creature within 10 feet of you that you can see. The creature must succeed on a Strength or Dexterity saving throw (its choice) or be restrained. While restrained by the vines, the creature repeats the saving throw at the end of each of its turns. On a success, it frees itself and the vines vanish.\n    Turn the Faithless: You can use your Channel Divinity to utter ancient words that are painful for fey and fiends to hear. As an action, you present your holy symbol, and each fey or fiend within 30 feet of you that can hear you must make a Wisdom saving throw. On a failed save, the creature is turned for 1 minute or until it takes damage. A turned creature must spend its turns trying to moves far away from you as it can, and it can\u0027t willingly move to a space within 30 feet of you. It also can\u0027t take reactions. For its action, it can use only the Dash action try to escape from an effect that prevents it from moving. If there\u0027s nowhere to move, the creature can use the Dodge action. If the creature\u0027s true form is concealed by an illusion, shape-shifting, or other effect, that form is revealed while it is turned. "},{"name":"Aura of Warding","description":"Beginning at 7th level, ancient magic lies so heavily upon you that it forms an eldritch ward. You and friendly creatures within 10 feet of you have resistance to damage from spells. At 18th level, the range of this aura increases to 30 feet. "},{"name":"Undying Sentinel","description":"Starting at 15th level, when you are reduced to 0 hit points and are not killed outright, you can choose to drop to 1 hit point instead. Once you use this ability, you can\u0027t use it again until you finish a long rest. Additionally, you suffer none of the drawbacks of old age, and you can\u0027t be aged magically. "},{"name":"Elder Champion","description":"At 20th level, you can assume the form of an ancient force of nature, taking on an appearance you choose. For example, your skin might turn green or take on a bark-like texture, your hair might become leafy or moss-like, or you might sprout antlers or a lion-like mane. Using your action, you undergo a transformation.\n\nFor 1 minute, you gain the following benefits:\n\n    At the start of each of your turns, you regain 10 hit points.\n    Whenever you cast a paladin spell that has a casting time of 1 action, you can cast it using a bonus action instead.\n    Enemy creatures within 10 feet of you have disadvantage on saving throws against your paladin spells and Channel Divinity options. \n\nOnce you use this feature, you can\u0027t use it again until you finish a long rest. "}],"description":"The Oath of the Ancients is as old as the race of elves and the rituals of the druids. Sometimes called fey knights, green knights, or horned knights, paladins who swear this oath cast their lot with the side of the light, the cosmic struggle against darkness, because they love the beautiful and life-giving things of the world, not necessarily because they believe in principles of honor, courage, and justice. They adorn their armor and clothing with images of growing things—leaves, antlers, or flowers—to reflect their commitment to preserving life and light in the world. "}],"hitdice":"1d10","lvlFeatures":[1,1,2,2,2,3,5,6,10,11,14],"features":[{"name":"Divine Sense","description":"The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell. You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses. "},{"name":"Lay on Hands","description":"Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level x 5. As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool. Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one. This feature has no effect on undead and constructs. "},{"name":"Fighting Style","description":"At 2nd level, you adopt a style of fighting as your specialty. Choose one of the following options. You can\u0027t take a Fighting Style option more than once, even if you later get to choose again.\nDefense\n\nWhile you are wearing armor, you gain a +1 bonus to AC.\nDueling\n\nWhen you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\nGreat Weapon Fighting\n\nWhen you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll. The weapon must have the two-handed or versatile property for you to gain this benefit.\nProtection\n\nWhen a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield. "},{"name":"Spellcasting","description":"By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does. See chapter 10 for the general rules of spellcasting and chapter 11 for the paladin spell list. "},{"name":"Divine Smite","description":"Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one paladin spell slot to deal radiant damage to the target, in addition to the weapon\u0027s damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell-level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend. "},{"name":"Divine Health","description":"By 3rd level, the divine magic flowing through you makes you immune to disease. "},{"name":"Extra Attack","description":"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. "},{"name":"Aura of Protection","description":"Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus. At 18th level, the range of this aura increases to 30 feet. "},{"name":"Aura of Courage","description":"Starting at 10th level. you and friendly creatures within 10 feet of you can\u0027t be frightened while you are conscious. At 18th level, the range of this aura increases to 30 feet. "},{"name":"Improved Divine Smite","description":"By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage. If you also use your Divine Smite with an attack, you add this damage to the extra damage of your Divine Smite. "},{"name":"Cleansing Touch","description":"Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest. "}]},
{"className":"Ranger","level":1,"subclass":{},"subclassOptions":[{"name":"Hunter","lvlFeatures":[3,7,11,15],"features":[{"name":"Hunter\u0027s Pray","description":"You gain one of the following features of your choice.\n\n    Colossus Slayer. Your tenacity can wear down the most potent foes. When you hit a creature with a weapon attack, the creature takes an extra 1d8 damage if it’s below its hit point maximum. You can deal this extra damage only once per turn.\n    Giant Killer. When a Large or larger creature within 5 feet of you hits or misses you with an attack, you can use your reaction to attack that creature immediately after its attack, provided that you can see the creature.\n    Horde Breaker. Once on each of your turns when you make a weapon attack, you can make another attack with the same weapon against a different creature that is within 5 feet of the original target and within range of your weapon. "},{"name":"Defensive Tactics","description":"At 7th level, you gain one of the following features of your choice.\n\n    Escape the Horde. Opportunity attacks against you are made with disadvantage.\n    Multiattack Defense. When a creature hits you with an attack, you gain a +4 bonus to AC against all subsequent attacks made by that creature for the rest of the turn.\n    Steel Will. You have advantage on saving throws against being frightened. "},{"name":"Multi-attack","description":"At 11th level, you gain one of the following features of your choice.\n\n    Volley. You can use your action to make a ranged attack against any number of creatures within 10 feet of a point you can see within your weapon\u0027s range. You must have ammunition for each target, as normal, and you make a separate attack roll for each target.\n    Whirlwind Attack. You can use your action to make a melee attack against any number of creatures within 5 feet of you. with a separate attack roll for each target. "},{"name":"Superior Hunter\u0027s Defense","description":"At 15th level, you gain one of the following features of your choice.\n\n    Evasion. You can nimbly dodge out of the way of certain area effects, such as a red dragon\u0027s fiery breath or a lightning bolt spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.\n    Stand Against the Tide. When a hostile creature misses you with a melee attack, you can use your reaction to force that creature to repeat the same attack against another creature (other than itself) of your choice.\n    Uncanny Dodge. When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack\u0027s damage against you. "}],"description":"Emulating the Hunter archetype means accepting your place as a bulwark between civilization and the terrors of the wilderness. As you walk the Hunter’s path, you learn specialized techniques for fighting the threats you face, from rampaging ogres and hordes of orcs to towering giants and terrifying dragons. "},{"name":"Beast Master","lvlFeatures":[3,7,11,15],"features":[{"name":"Ranger\u0027s Companion","description":"You gain a beast companion that accompanies you on your adventures and is trained to fight alongside you. Choose a beast that is no larger than Medium and that has a challenge rating of 1/4 or lower. Add your proficiency bonus to the beast’s AC, attack rolls, and damage rolls, as well as to any saving throws and skills it is proficient in. Its hit point maximum equals its normal maximum or four times your ranger level, whichever is higher.\n\nThe beast obeys your commands as best as it can. It takes its turn on your initiative, though it doesn’t take an action unless you command it to. On your turn, you can verbally command the beast where to move (no action required by you). You can use your action to verbally command it to take the Attack, Dash, Disengage, Dodge, or Help action. Once you have the Extra Attack feature, you can make one attack yourself and you can command the beast to take an Attack action.\n\nWhile traveling through your favored terrain with only the beast, you can move stealthily at a normal pace. If the beast dies, you can obtain another one by spending 8 hours magically bonding with another beast that isn’t hostile to you, either the same type of beast as before or a different one.\n\nLike any creature, the beast can spend Hit Dice during a short rest. If you are incapacitated or absent, the beast acts on its own, focusing on protecting you and itself. It never requires your command to use its reaction, such as when making an opportunity attack. "},{"name":"Exceptional Training","description":"Beginning at 7th level, on any of your turns when your beast companion doesn\u0027t attack, you can use a bonus action to command the beast to take the Dash, Disengage, Dodge, or Help action on its turn. "},{"name":"Bestial Fury","description":"Starting at 11th level, when you command your beast companion to take the Attack action, the beast can make two attacks, or it can take the Multiattack action if it has that action. "},{"name":"Share Spells","description":"Beginning at 15th level, when you cast a spell targeting yourself, you can also affect your beast companion with the spell if the beast is within 30 feet of you. "}],"description":"The Beast Master archetype embodies a friendship between the civilized races and the beasts of the world. United in focus, beast and ranger work as one to fight the monstrous foes that threaten civilization and the wilderness alike. Emulating the Beast Master archetype means committing yourself to this ideal, working in partnership with an animal as its companion and friend. "}],"hitdice":"1d10","lvlFeatures":[1,1,2,2,3,5,10,14,18,20],"features":[{"name":"Favored Enemy","description":"You have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. Choose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and goblins) as favored enemies.\n\nYou have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them. When you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all.\n\nYou choose one additional favored enemy, as well as an associated language, at 6th and 14th level. As you gain levels, your choices should reflect the types of monsters you have encountered on your adventure. "},{"name":"Natural Explorer","description":"You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you’re proficient in. While traveling for an hour or more in your favored terrain, you gain the following benefits:\n\n    Difficult terrain doesn’t slow your group’s travel.\n    Your group can’t become lost except by magical means.\n    Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.\n    If you are traveling alone, you can move stealthily at a normal pace.\n    When you forage, you find twice as much food as you normally would.\n    While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area. \n\nYou choose additional favored terrain types at 6th and 10th level. "},{"name":"Fighting Style","description":"At 2nd level, you adopt a particular style of fighting as your specialty. You can\u0027t take a Fighting Style option more than once, even if you later get to choose again. Choose one of the following options:\n\n    Archery. You gain a +2 bonus to attack rolls you make with ranged weapons.\n    Defence. While you are wearing armor, you gain a +1 bonus to AC.\n    Dueling. When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\n    Two-Weapon Fighting. When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack. "},{"name":"Spellcasting","description":"You have learned to use the magical essence of nature to cast spells, much as a druid does. You cast Ranger Spells. "},{"name":"Primeval Awareness","description":"Beginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn\u0027t reveal the creatures\u0027 location or number. "},{"name":"Extra Attack","description":"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. "},{"name":"Land\u0027s Stride","description":"Starting at 8th level, moving through non-magical difficult terrain costs you no extra movement. You can also pass through non-magical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.\n\nIn addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such as those created by the entangle spell. "},{"name":"Hide in Plain Sight","description":"Starting at 10th level, you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt. plants. soot. and other naturally occurring materials with which to create your camouflage.\n\nOnce you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit. "},{"name":"Vanish","description":"Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can\u0027t be tracked by non-magical means, unless you choose to leave a trail. "},{"name":"Feral Senses","description":"At 18th level, you gain preternatural senses that help you fight creatures you can\u0027t see. When you attack a creature you can\u0027t see, your inability to see it doesn\u0027t impose disadvantage on your attack rolls against it.\n\nYou are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn\u0027t hidden from you and you aren\u0027t blinded or deafened. "},{"name":"Foe Slayer","description":"At 20th level, you become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied. "}]},
{"className":"Rogue","level":1,"subclass":{},"subclassOptions":[{"name":"Arcane Trickster","lvlFeatures":[3,3,9,13,17],"features":[{"name":"Spellcasting","description":"Arcane Tricksters gain the ability to cast Wizard spells to enhance their abilities, trick their foes, and defend themselves more effectively. "},{"name":"Mage Hand Legerdemain","description":"Starting at 3rd level, when you cast mage hand, you can make the spectral hand invisible, and you can perform the following additional tasks with it:\n\n    You can stow one object the hand is holding in a container worn or carried by another creature.\n    You can retrieve an object in a container worn or carried by another creature.\n    You can use thieves’ tools to pick locks and disarm traps at range. \n\nYou can perform one of these tasks without being noticed by a creature if you succeed on a Dexterity (Sleight of Hand) check contested by the creature’s Wisdom (Perception) check. In addition, you can use the bonus action granted by your Cunning Action to control the hand. "},{"name":"Magical Ambush","description":"Starting at 9th level, if you are hidden from a creature when you cast a spell on it, the creature has disadvantage on any saving throw it makes against the spell this turn. "},{"name":"Versatile Trickster","description":"At 13th level, you gain the ability to distract targets with your Mage Hand. As a bonus action on your turn, you can designate a creature within 5 feet of the spectral hand created by the spell. Doing so gives you Advantage on attack rolls against that creature until the end of the turn, and therefore allowing you to Sneak Attack the creature when nobody else is within 5 feet. "},{"name":"Spell Thief","description":"At 17th level, you gain the ability to magically steal the knowledge of how to cast a spell from another spellcaster.\n\n    Immediately after a creature casts a spell that targets you or includes you in its area of effect, you can use your Reaction to force the creature to make a saving throw with its spellcasting ability modifier.\n    The DC equals your spell save DC and on a failed save, you negate the spell’s effect against you, and you steal the knowledge of the spell if it is at least 1st level and of a level you can cast (it doesn’t need to be a wizard spell).\n    For the next 8 hours, you know the spell, can cast it using your spell slots, and the creature can’t cast that spell until the 8 hours have passed.\n    Once you use this feature, you can’t use it again until you finish a long rest. "}],"description":"Some rogues enhance their fine-honed skills of stealth and agility with magic, learning tricks of enchantment and illusion. These rogues include pickpockets and burglars, but also pranksters, mischief-makers, and a significant number of adventurers. "},{"name":"Assassin","lvlFeatures":[3,3,9,13,17],"features":[{"name":"Bonus Proficiencies","description":"You gain proficiency with the disguise kit and the poisoner’s kit. "},{"name":"Assassinate","description":"Starting at 3rd level, you are at your deadliest when you get the drop on your enemies. You have Advantage on attack rolls against any creature that hasn’t taken a turn in the combat yet. In addition, any hit you score against a creature that is surprised is a critical hit.\n\n    For reference, creatures that are \"Surprised\" can\u0027t move or take actions on their first turn of combat if they fail to notice approaching threats. This is done by comparing the Dexterity (stealth) checks of those hiding to the Wisdom (perception) checks of those not at the start of combat. "},{"name":"Infiltration Expertise","description":"Starting at 9th level, you can unfailingly create false identities for yourself. You must spend seven days and 25 gp to establish the history, profession, and affiliations for an identity. You can\u0027t establish an identity that belongs to someone else. For example, you might acquire appropriate clothing, letters of introduction, and official-looking certificates to establish yourself as a member of a trading house from a remote city so you can insinuate yourself into the company of other wealthy merchants. Thereafter, if you adopt the new identity as a disguise, other creatures believe you to be that person until given an obvious reason not to. "},{"name":"Imposter","description":"At the 13th level, you gain the ability to unerringly mimic another person\u0027s speech, writing, and behavior. You must spend at least three hours studying these three components of the person\u0027s behavior, listening to speech, examining handwriting, and observing mannerisms. Your ruse is indiscernible to the casual observer. If a wary creature suspects something is amiss, you have advantage on any Charisma (deception) check you make to avoid detection. "},{"name":"Death Strike","description":"Starting at the 17th level, you become a master of instant death. When you attack and hit a creature that is surprised, it must make a Constitution saving throw (DC 8 + your Dexterity modifier + your proficiency bonus.) On a failed save, double the damage of your attack against the creature. "}],"description":"You focus your training on the grim art of death. Those who adhere to this archetype are diverse hired killers, spies, bounty hunters, and even specially anointed priests trained to exterminate the enemies of their deity. Stealth, poison, and disguise help you eliminate your foes with deadly efficiency. "},{"name":"Thief","lvlFeatures":[3,3,9,13,17],"features":[{"name":"Fast Hands","description":"Starting at 3rd level, you can use the bonus action granted by your Cunning Action to:\n\n    Make a Dexterity (Sleight of Hand) check\n    Use your thieves’ tools to disarm a trap or open a lock.\n    Take the Use an Object action. "},{"name":"Second Story Work","description":"When you choose this archetype at 3rd level, you gain the ability to climb faster than normal; climbing no longer costs you extra movement. In addition, when you make a running jump, the distance you cover increases by a number of feet equal to your Dexterity modifier. "},{"name":"Supreme Sneak","description":"Starting at 9th level, you have advantage on a Dexterity (Stealth) check if you move no more than half your speed on the same turn. "},{"name":"Use Magic Device","description":"By 13th level, you have learned enough about the workings of magic that you can improvise the use of items even when they are not intended for you. You ignore all class, race, and level requirements on the use of magic items. "},{"name":"Thief\u0027s Reflexes","description":"When you reach 17th level, you have become adept at laying ambushes and quickly escaping danger. You can take two turns during the first round of any combat. You take your first turn at your normal initiative and your second turn at your initiative minus 10. During each of those separate turns, you get an action and a bonus action, totaling two of each on your first round of combat. Because these are considered two separate turns, you may also Sneak Attack per the normal rules (if eligible) on each turn. That said, you can’t use this feature when you are surprised. "}],"description":"You hone your skills in the larcenous arts. Burglars, bandits, cutpurses, and other criminals typically follow this archetype, but so do rogues who prefer to think of themselves as professional treasure seekers, explorers, delvers, and investigators. In addition to improving your agility and stealth, you learn skills useful for delving into ancient ruins, reading unfamiliar languages, and using magic items you normally couldn’t employ. "}],"hitdice":"1d8","lvlFeatures":[1,1,1,2,5,7,11,14,15,18,20],"features":[{"name":"Sneak Attack","description":"You know how to strike subtly and exploit a foe’s distraction. Once per turn, you can deal extra 1d6 damage to one creature you hit with an attack if you have Advantage on the attack roll. The attack must use a finesse or a ranged weapon. As you gain levels, the amount of damage increases, as shown on the level table.\n\n    You don\u0027t need Advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn\u0027t incapacitated, and you don\u0027t have Disadvantage on the attack roll.\n    Rogues typically only get one Sneak Attack per round of combat. However if some circumstance or feature allows them to react during another creature\u0027s turn, such as an Attack of Opportunity, the Battlemaster\u0027s Commander’s Strike, or the Thief Archetype\u0027s \"Thief\u0027s Reflexes\", and all other qualifications are met, the Rogue may get a second or third Sneak Attack during a single round of combat. "},{"name":"Expertise","description":"At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves\u0027 tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.\n\nAt 6th level, you can choose two more of your proficiencies (in skills or with thieves tools) to gain this benefit. "},{"name":"Thieves\u0027 Cant","description":"During your rogue training you learned thieves’ cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves’ cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly. In addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves’ guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run. "},{"name":"Cunning Action","description":"Starting at your second level, your quick thinking and agility allow you to move and act quickly. You can take a Bonus Action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action. "},{"name":"Uncanny Dodge","description":"Starting at 5th level, when an attacker that you can see hits you with an Attack, you can use your Reaction to halve the attack\u0027s damage against you.\n\n    Only damage resulting from attack rolls such as melee attacks, ranged attacks, or spells with attack rolls (i.e. firebolt, guiding bolt) qualify for Uncanny Dodge.\n    Due to the restriction of using your Reaction, only one attack per round can qualify for Uncanny Dodge. "},{"name":"Evasion","description":"Beginning at 7th level, you can nimbly dodge out of the way of certain area effects, such as a red dragon\u0027s fiery breath or an Ice Storm spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail. "},{"name":"Reliable Talent","description":"By 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10. "},{"name":"Blindsense","description":"Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or Invisible creature within 10 feet of you. "},{"name":"Slippery Mind","description":"By 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws. "},{"name":"Elusive","description":"Beginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No Attack roll has advantage against you while you aren\u0027t Incapacitated. "},{"name":"Stroke of Luck","description":"At 20th level, you have an uncanny knack for succeeding when you need to. If your Attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20. Once you use this feature, you can\u0027t use it again until you finish a Short or Long Rest. "}]},
{"className":"Sorcerer","level":1,"subclass":{},"subclassOptions":[{"name":"Draconic Bloodline","lvlFeatures":[1,1,6,14,18],"features":[{"name":"Draconic Ancestor","description":"At 1st level, you choose one type of dragon as your ancestor. The damage type associated with each dragon is used by features you gain later. "},{"name":"Draconic Resilience","description":"As magic flows through your body, it causes physical traits of your dragon ancestors to emerge. At 1st level, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class.\n\nAdditionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren’t wearing armor, your AC equals 13 + your Dexterity modifier. "},{"name":"Elemental Affinity","description":"Starting at 6th level, when you cast a spell that deals damage of the type associated with your draconic ancestry, add your Charisma modifier to that damage. The damage bonus applies to one damage roll of a spell, not multiple rolls. At the same time, you can spend 1 sorcery point to gain resistance to that damage type for 1 hour. "},{"name":"Dragon Wings","description":"At 14th level, you gain the ability to sprout a pair of dragon wings from your back, gaining a flying speed equal to your current speed. You can create these wings as a bonus action on your turn. They last until you dismiss them as a bonus action on your turn.\n\nYou can’t manifest your wings while wearing armor unless the armor is made to accommodate them, and clothing not made to accommodate your wings might be destroyed when you manifest them. "},{"name":"Draconic Presence","description":"Beginning at 18th level, you can channel the dread presence of your dragon ancestor, causing those around you to become awestruck or frightened. As an action, you can spend 5 sorcery points to draw on this power and exude an aura of awe or fear (your choice) to a distance of 60 feet. For 1 minute or until you lose your concentration (as if you were casting a concentration spell), each hostile creature that starts its turn in this aura must succeed on a Wisdom saving throw or be charmed (if you chose awe) or frightened (if you chose fear) until the aura ends. A creature that succeeds on this saving throw is immune to your aura for 24 hours "}],"description":"Your innate magic comes from draconic magic that was mingled with your blood or that of your ancestors. Most often, sorcerers with this origin trace their descent back to a mighty sorcerer of ancient times who made a bargain with a dragon or who might even have claimed a dragon parent. Some of these bloodlines are well established in the world, but most are obscure. Any given sorcerer could be the first of a new bloodline, as a result of a pact or some other exceptional circumstance. "},{"name":"Wild Magic","lvlFeatures":[1,1,6,14,18],"features":[{"name":"Wild Magic Surge","description":"Starting when you choose this origin at 1st level, your spellcasting can unleash surges of untamed magic. Immediately after you cast a sorcerer spell of 1st level or higher, the DM can have you roll a d20. If you roll a 1, roll on the Wild Magic Surge table to create a random magical effect. "},{"name":"Tides of Chaos","description":"Starting at 1st level, you can manipulate the forces of chance and chaos to gain advantage on one attack roll, ability check, or saving throw. Once you do so, you must finish a long rest before you can use this feature again.\n\nAny time before you regain the use of this feature, the DM can have you roll on the Wild Magic Surge table immediately after you cast a sorcerer spell of 1st level or higher. You then regain the use of this feature. "},{"name":"Bend Luck","description":"Starting at 6th level, you have the ability to twist fate using your wild magic. When another creature you can see makes an attack roll, an ability check, or a saving throw, you can use your reaction and spend 2 sorcery points to roll 1d4 and apply the number rolled as a bonus or penalty (your choice) to the creature’s roll. You can do so after the creature rolls but before any effects of the roll occur. "},{"name":"Controlled Chaos","description":"At 14th level, you gain a modicum of control over the surges of your wild magic. Whenever you roll on the Wild Magic Surge table, you can roll twice and use either number. "},{"name":"Spell Bombardment","description":"Beginning at 18th level, the harmful energy of your spells intensifies. When you roll damage for a spell and roll the highest number possible on any of the dice, choose one of those dice, roll it again and add that roll to the damage. You can use the feature only once per turn. "}],"description":"Your innate magic comes from the wild forces of chaos that underlie the order of creation. You might have endured exposure to some form of raw magic, perhaps through a planar portal leading to Limbo, the Elemental Planes, or the mysterious Far Realm. Perhaps you were blessed by a powerful fey creature or marked by a demon. Or your magic could be a fluke of your birth, with no apparent cause or reason. However it came to be, this chaotic magic churns within you, waiting for any outlet. "}],"hitdice":"1d6","lvlFeatures":[1,2,3,20],"features":[{"name":"Sorcerous Origin","description":"Choose a sorcerous origin, which describes the source of your innate magical power: Draconic Bloodline, Wild Magic, Divine Soul[2], Shadow Magic[2], Storm Sorcery[2], Phoenix Sorcery[3], Sea Sorcery[3], or Stone Sorcery[3].\n\nYour choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level. "},{"name":"Font of Magic","description":"At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects. "},{"name":"Metamagic","description":"At 3rd level, you gain the ability to twist your spells to suit your needs. You gain two of the following Metamagic options of your choice. You gain another one at 10th and 17th level.\n\nYou can use only one Metamagic option on a spell when you cast it, unless otherwise noted.\nCareful Spell\n\nWhen you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell\u0027s full force. To do so, you spend 1 sorcery point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell.\nDistant Spell\n\nWhen you cast a spell that has a range of 5 feet or greater, you can spend 1 sorcery point to double the range of the spell.\n\nWhen you cast a spell that has a range of touch, you can spend 1 sorcery point to make the range of the spell 30 feet.\nEmpowered Spell\n\nWhen you roll damage for a spell, you can spend 1 sorcery point to reroll a number of the damage dice up to your Charisma modifier (minimum of one). You must use the new rolls.\n\nYou can use Empowered Spell even if you have already used a different Metamagic option during the casting of the spell.\nExtended Spell\n\nWhen you cast a spell with a duration of 1 minute or longer, you can spend 1 sorcery point to double its duration, to a maximum duration of 24 hours.\nHeightened Spell\n\nWhen you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 sorcery points to give one target of the spell disadvantage on its first saving throw made against the spell.\nQuickened Spell\n\nWhen you cast a spell that has a casting time of 1 action, you can spend 2 sorcery points to change the casting time to 1 bonus action for this casting.\nSubtle Spell\n\nWhen you cast a spell, you can spend 1 sorcery point to cast it without any somatic or verbal components.\nTwinned Spell\n\nWhen you cast a spell that targets only one creature and doesn\u0027t have a range of self, you can spend a number of sorcery points equal to the spell\u0027s level to target a second creature in range with the same spell (1 sorcery point if the spell is a cantrip).\n\nTo be eligible for Twinned Spell, a spell must be incapable of targeting more than one creature at the spell’s current level.[4] "},{"name":"Sorcerous Restoration","description":"At 20th level, you regain 4 expended sorcery points whenever you finish a short rest. "}]},
{"className":"Warlock","level":1,"subclass":{},"subclassOptions":[{"name":"The Great Old One","lvlFeatures":[1,6,10,14],"features":[{"name":"Awakened Mind","description":"Starting at 1st level, your alien knowledge gives you the ability to touch the minds of other creatures. You can communicate telepathically with any creature you can see within 30 feet of you. You don\u0027t need to share a language with the creature for it to understand your telepathic utterances, but the creature must be able to understand at least one language. "},{"name":"Entropic Ward","description":"At 6th level, you learn to magically ward yourself against attack and to turn an enemy\u0027s failed strike into good luck for yourself. When a creature makes an attack roll against you, you can use your reaction to impose disadvantage on that roll. If the attack misses you, your next attack roll against the creature has advantage if you make it before the end of your next turn. Once you use this feature, you can\u0027t use it again until you finish a short or long rest. "},{"name":"Thought Shield","description":"Starting at 10th level, your thoughts can\u0027t be read by telepathy or other means unless you allow it. You have resistance to psychic damage, and whenever a creature deals psychic damage to you, that creature takes the same amount of damage that you do. "},{"name":"Create Thrall","description":"At 14th level, you gain the ability to infect a humanoid\u0027s mind with the alien magic of your patron. You can use your action to touch an incapacitated humanoid. That creature is charmed by you until a remove curse spell is cast on it, the charm condition is removed from it, or you use this feature again. You can communicate telepathically with the charmed creature as long as the two of you are on the same plane of existence. "}],"description":"Your patron is a mysterious entity whose nature is utterly foreign to the fabric of reality. It might come from the Far Realm, the space beyond reality, or it could be one of the elder gods known only in legends. Its motives are incomprehensible to mortals, and its knowledge so immense and ancient that even the greatest libraries pale in comparison to the vast secrets it holds. The Great Old One might be unaware of your existence or entirely indifferent to you, but the secrets you have learned allow you to draw your magic from it. Entities of this type include Ghaunadar, called That Which Lurks; Tharizdun. the Chained God; Dendar, the Night Serpent; Zargon, the Returner; Great Cthulhu; and other unfathomable beings. "},{"name":"The Archfey","lvlFeatures":[1,6,10,14],"features":[{"name":"Fey Presence","description":"Starting at 1st level, your patron bestows upon you the ability to project the beguiling and fearsome presence of the fey. As an action, you can cause each creature in a 10-foot cube originating from you to make a Wisdom saving throw against your warlock spell save DC. The creatures that fail their saving throw are all charmed or frightened by you (your choice) until the end of your next turn. Once you use this feature, you can\u0027t use it again until you finish a short or long rest. "},{"name":"Misty Escape","description":"Starting at 6th level, you can vanish in a puff of mist in response to harm. When you take damage, you can use your reaction to turn invisible and teleport up to 60 feet to an unoccupied space you can see. You remain invisible until the start of your next turn or until you attack or cast a spell. Once you use this feature, you can\u0027t use it again until you finish a short or long rest. "},{"name":"Beguiling Defenses","description":"Beginning at 10th level, your patron teaches you how to turn the mind-affecting magic of your enemies against them. You are immune to being charmed, and when another creature attempts to charm you, you can use your reaction to attempt to turn the charm back on that creature. The creature must succeed on a Wisdom saving throw against your warlock spell save DC or be charmed by you for 1 minute or until the creature takes any damage. "},{"name":"Dark Delirium","description":"Starting at 14th level, you can plunge a creature into an illusory realm. As an action, choose a creature that you can see within 60 feet of you. It must make a Wisdom saving throw against your warlock spell save DC. On a failed save, it is charmed or frightened by you (your choice) for 1 minute or until your concentration is broken (as if you are concentrating on a spell). This effect ends early if the creature takes any damage. Until this illusion ends, the creature thinks it is lost in a misty realm, the appearance of which you choose. The creature can see and hear only itself, you, and the illusion. You must finish a short or long rest before you can use this feature again. "}],"description":"Your patron is a lord or lady of the fey, a creature of legend who holds secrets that were forgotten before the mortal races were born. This being\u0027s motivations are often inscrutable, and sometimes whimsical, and might involve a striving for greater magical power or the settling of age-old grudges. Beings of this sort include the Prince of Frost; the Queen of Air and Darkness, ruler of the Gloaming Court; Titania of the Summer Court; her consort Oberon, the Green Lord; Hyrsam, the Prince of Fools; and ancient hags. "},{"name":"The Fiend","lvlFeatures":[1,6,10,14],"features":[{"name":"Dark One\u0027s Blessing","description":"Starting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum of 1). "},{"name":"Dark One\u0027s Own Luck","description":"Starting at 6th level, you can call on your patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add 1d10 to your roll. You can do so after seeing the initial roll but before any of the roll\u0027s effects occur. Once you use this feature, you can\u0027t use it again until you finish a short or long rest. "},{"name":"Fiendish Resilience","description":"Starting at 10th level, you can choose one damage type when you finish a short or long rest. You gain resistance to that damage type until you choose a different one with this feature. Damage from magical weapons or silver weapons ignores this resistance. "},{"name":"Hurl Through Hell","description":"Starting at 14th level, when you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape. At the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes 10d10 psychic damage as it reels from its horrific experience. Once you use this feature, you can\u0027t use it again until you finish a long rest. "}],"description":"You have made a pact with a fiend from the lower planes of existence, a being whose aims are evil, even if you strive against those aims. Such beings desire the corruption or destruction of all things, ultimately including you. Fiends powerful enough to forge a pact include demon lords such as Demogorgon, Orcus, Fraz\u0027Urb-luu, and Baphomet; archdevils such as Asmodeus, Dispater, Mephistopheles, and Belial; pit fiends and balors that are especially mighty; and ultroloths and other lords of the yugoloths. "}],"hitdice":"1d8","lvlFeatures":[1,2,11,20],"features":[{"name":"Otherwordly Patron","description":"At 1st level, you have struck a bargain with an otherworldly being of your choice: the Archfey, the Celestial, the Fiend, the Great Old One, the Hexblade, the Raven Queen, the Seeker, or the Undying, each of which is detailed at the end of the class description. Your choice grants you special features. "},{"name":"Eldritch Invocations","description":"In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability. At 2nd level, you gain two eldritch invocations of your choice. Your invocation options are detailed at the end of the class description. When you gain certain warlock levels, you gain additional invocations of your choice, as shown in the Invocations Known column of the Warlock table. Additionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level. "},{"name":"Mystic Arcanum","description":"At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th- level spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again. At higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th- level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest. "},{"name":"Eldritch Master","description":"At 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again. "}]},
{"className":"Wizard","level":1,"subclass":{},"subclassOptions":[{"name":"School of Divination","lvlFeatures":[2,2,6,10,14],"features":[{"name":"Divination Savant","description":"Beginning when you select this school at 2nd level, the gold and time you must spend to copy a divination spell into your spellbook is halved. "},{"name":"Portent","description":"Starting at 2nd level when you choose this school, glimpses of the future begin to press in on your awareness. When you finish a long rest, roll two d20 and record the numbers rolled. You can replace any attack roll, saving throw, or ability check made by you or a creature that you can see with one of these foretelling rolls. You must choose to do so before the roll, and you can replace a roll in this way only once per turn. Each foretelling roll can be used only once. When you finish a long rest, you lose any unused foretelling rolls. "},{"name":"Expert Divination","description":"Beginning at 6th level, casting divination spells comes so easily to you that it expends only a fraction of your spellcasting efforts. When you cast a divination spell of 2nd level or higher using a spell slot, you regain one expended spell slot. The slot you regain must be of a level lower than the spell you cast and can’t be higher than 5th level. "},{"name":"The Third Eye","description":"Starting at 10th level, you can use your action to increase your powers of perception. When you do so, choose one of the following benefits, which lasts until you are incapacitated or you take a short or long rest. You can’t use the feature again until you finish a rest.\n\n    Darkvision. You gain darkvision out to a range of 60 feet, as described in chapter 8.\n    Ethereal Sight. You can see into the Ethereal Plane within 60 feet of you.\n    Greater Comprehension. You can read any language.\n    See Invisibility. You can see invisible creatures and objects within 10 feet of you that are within line of sight. "},{"name":"Greater Portent","description":"Starting at 14th level, the visions in your dreams intensify and paint a more accurate picture in your mind of What is to come. You roll three d20 for your Portent feature, rather than two. "}],"description":"The counsel of a diviner is sought by royalty and commoners alike, for all seek a clearer understanding of the past, present, and future. As a diviner, you strive to part the veils of space, time, and consciousness so that you can see clearly. You work to master spells of discernment, remote viewing, supernatural knowledge, and foresight. "},{"name":"School of Transmutation","lvlFeatures":[2,2,6,10,14],"features":[{"name":"Transmutation Savant","description":"Beginning when you select this school at 2nd level, the gold and time you must spend to copy a transmutation spell into your spellbook is halved. "},{"name":"Minor Alchemy","description":"Starting at 2nd level when you select this school, you can temporarily alter the physical properties of one nonmagical object, changing it from one substance into another. You perform a special alchemical procedure on one object composed entirely of wood, stone (but not a gemstone), iron, copper, or silver, transforming it into a different one of those materials. For each 10 minutes you spend performing the procedure, you can transform up to 1 cubic foot of material. After 1 hour, or until you lose your concentration (as if you were concentrating on a spell), the material reverts to its original substance. "},{"name":"Transmuter\u0027s Stone","description":"Starting at 6th level, you can spend 8 hours creating a transmuter’s stone that stores transmutation magic. You can benefit from the stone yourself or give it to another creature. A creature gains a benefit of your choice as long as the stone is in the creature’s possession. When you create the stone, choose the benefit from the following options:\n\n    Darkvision out to a range of 60 feet, as described in chapter 8\n    An increase to speed of 10 feet while the creature is unencumbered\n    Proficiency in Constitution saving throws\n    Resistance to acid, cold, fire, lightning, or thunder damage (your choice whenever you choose this benefit) \n\nEach time you cast a transmutation spell of 1st level or higher, you can change the effect of your stone if the stone is on your person. If you create a new transmuter’s stone, the previous one ceases to function. "},{"name":"Shapechanger","description":"At 10th level. you add the polymorph spell to your spellbook. if it is not there already. You can cast polymorph without expending a spell slot. When you do so, you can target only yourself and transform into a beast whose challenge rating is 1 or lower. Once you cast polymorph in this way, you can’t do so again until you finish a short or long rest, though you can still cast it normally using an available spell slot. "},{"name":"Master Transmuter","description":"Starting at 14th level, you can use your action to consume the reserve of transmutation magic stored within your transmuter’s stone in a single burst. When you do so, choose one of the following effects. Your transmuter’s stone is destroyed and can’t be remade until you finish a long rest.\n\n    Major Transformation. You can transmute one nonmagical object—no larger than a 5—foot cube into another nonmagical object of similar size and mass and of equal or lesser value. You must spend 10 minutes handling the object to transform it.\n    Panacea. You remove all curses, diseases, and poisons affecting a creature that you touch with the transmuter’s stone. The creature also regains all its hit points.\n    Restore Life. You cast the raise dead spell on a creature you touch with the transmuter’s stone, without expending a spell slot or needing to have the spell in your spellbook.\n    Restore Youth. You touch the transmuter’s stone to a willing creature, and that creature’s apparent age is reduced by 3d10 years, to a minimum of 13 years. This effect doesn’t extend the creature’s lifespan. "}],"description":"You are a student of spells that modify energy and matter, to you, the world is not a fixed thing. but eminently mutable, and you delight in being an agent of change. You wield the raw stuff of creation and learn to alter both physical forms and mental qualities. Your magic gives you the tools to become a smith on reality’s forge.\n\nSome transmuters are tinkerers and pranksters, turning people into toads and transforming copper into silver for fun and occasional profit. Others pursue their magical studies with deadly seriousness, seeking the power of the gods to make and destroy worlds. "},{"name":"School of Enchantment","lvlFeatures":[2,2,6,10,14],"features":[{"name":"Enchantment Savant","description":"Beginning when you select this school at 2nd level, the gold and time you must spend to copy an enchantment spell into your spellbook is halved. "},{"name":"Hypnotic Gaze","description":"Starting at 2nd level when you choose this school, your soft words and enchanting gaze can magically enthrall another creature. As an action, choose one creature that you can see within 5 feet of you. If the target can see or hear you, it must succeed on a Wisdom saving throw against your wizard spell save DC or be charmed by you until the end of your next turn. The charmed creature’s speed drops to 0, and the creature is incapacitated and visibly dazed.\n\nOn subsequent turns, you can use your action to maintain this effect, extending its duration until the end of your next turn. However, the effect ends if you move more than 5 feet away from the creature, if the creature can neither see nor hear you, or if the creature takes damage. Once the effect ends, or if the creature succeeds on its initial saving throw against this effect, you can’t use this feature on that creature again until you finish a long rest. "},{"name":"Instinctive Charm","description":"Beginning at 6th level, when a creature you can see within 30 feet of you makes an attack roll against you, you can use your reaction to divert the attack, provided that another creature is within the attack’s range. The attacker must make a Wisdom saving throw against your wizard spell save DC. On a failed save, the attacker must target the creature that is closest to it, not including you or itself. If multiple creatures are closest, the attacker chooses which one to target. On a successful save, you can’t use this feature on the attacker again until you finish a long rest.\n\nYou must choose to use this feature before knowing whether the attack hits or misses. Creatures that can’t be charmed are immune to this effect. "},{"name":"Split Enchantment","description":"Starting at 10th level, when you cast an enchantment spell of 1st level or higher that targets only one creature, you can have it target a second creature. "},{"name":"Alter Memories","description":"At 14th level, you gain the ability to make a creature unaware of your magical influence on it. When you cast an enchantment spell to charm one or more creatures, you can alter one creature’s understanding so that it remains unaware of being charmed.\n\nAdditionally, once before the spell expires, you can use your action to try to make the chosen creature forget some of the time it spent charmed. The creature must succeed on an Intelligence saving throw against your Wizard spell save DC or lose a number of hours of its memories equal to 1 + your Charisma modifier (minimum 1). You can make the creature forget less time, and the amount of time can’t exceed the duration of your enchantment spell. "}],"description":"As a member of the School of Enchantment, you have honed your ability to magically entrance and beguile other people and monsters. Some enchanters are peacemakers who bewitch the violent to lay down their arms and charm the cruel into showing mercy. Others are tyrants who magically bind the unwilling into their service. Most enchanters fall somewhere in between. "},{"name":"School of Abjuration","lvlFeatures":[2,2,6,10,14],"features":[{"name":"Abjuration Savant","description":"Beginning when you select this school at 2nd level, the gold and time you must spend to copy an abjuration spell into your spellbook is halved. "},{"name":"Arcane Ward","description":"Starting at 2nd level, you can weave magic around yourself for protection. When you cast an abjuration spell of 1st level or higher, you can simultaneously use a strand of the spell’s magic to create a magical ward on yourself that lasts until you finish a long rest. The ward has hit points equal to twice your wizard level + your Intelligence modifier. Whenever you take damage, the ward takes the damage instead. If this damage reduces the ward to 0 hit points, you take any remaining damage.\n\nWhile the ward has 0 hit points, it can’t absorb damage. but its magic remains. Whenever you cast an abjuration spell of 1st level or higher, the ward regains a number of hit points equal to twice the level of the spell. Once you create the ward, you can’t create it again until you finish a long rest. "},{"name":"Projected Ward","description":"Starting at 6th level, when a creature that you can see within 30 feet of you takes damage, you can use your reaction to cause your Arcane Ward to absorb that damage. If this damage reduces the ward to 0 hit points. the warded creature takes any remaining damage. "},{"name":"Improved Abjuration","description":"Beginning at 10th level. when you cast an abjuration spell that requires you to make an ability check as a part of casting that spell (as in counterspell and dispel magic), you add your proficiency bonus to that ability check. "},{"name":"Spell Resistance","description":"Starting at 14th level, you have advantage on saving throws against spells. Furthermore, you have resistance against the damage of spells. "}],"description":"The School of Abjuration emphasizes magic that blocks, banishes, or protects. Detractors of this school say that its tradition is about denial, negation rather than positive assertion. You understand, however, that ending harmful effects, protecting the weak, and banishing evil influences is anything but a philosophical void. It is a proud and respected vocation.\n\nCalled abjurers, members of this school are sought when baleful spirits require exorcism, when important locations must be guarded against magical spying, and when portals to other planes of existence must be closed. "},{"name":"School of Illusion","lvlFeatures":[2,2,6,10,14],"features":[{"name":"Illusion Savant","description":"Beginning when you select this school at 2nd level, the gold and time you must spend to copy an illusion spell into your spellbook is halved. "},{"name":"Improved Minor Illusion","description":"When you choose this school at 2nd level, you learn the minor illusion cantrip. If you already know this cantrip, you learn a different wizard cantrip of your choice. The cantrip doesn’t count against your number of cantrips known. When you cast minor illusion, you can create both a sound and an image with a single casting of the spell. "},{"name":"Malleable Illusions","description":"Starting at 6th level, when you cast an illusion spell that has a duration of 1 minute or longer, you can use your action to change the nature of that illusion (using the spell’s normal parameters for the illusion), provided that you can see the illusion. "},{"name":"Illusory Self","description":"Beginning at 10th level, you can create an illusory duplicate of yourself as an instant, almost instinctual reaction to danger. When a creature makes an attack roll against you, you can use your reaction to interpose the illusory duplicate between the attacker and yourself. The attack automatically misses you, then the illusion dissipates. Once you use this feature, you can’t use it again until you finish a short or long rest. "},{"name":"Illusory Reality","description":"By 14th level, you have learned the secret of weaving shadow magic into your illusions to give them a semi-reality. When you cast an illusion spell of 1st level or higher, you can Choose one inanimate, nonmagical object that is part of the illusion and make that object real. You can do this on your turn as a bonus action while the spell is ongoing. The object remains real for 1 minute. For example, you can create an illusion of a bridge over a chasm and then make it real long enough for your allies to cross. The object can’t deal damage or otherwise directly harm anyone. "}],"description":"You focus your studies on magic that dazzles the senses, befuddles the mind, and tricks even the wisest folk. Your magic is subtle, but the illusions crafted by your keen mind make the impossible seem real. Some illusionists—including many gnome wizards—are benign tricksters who use their spells to entertain. Others are more sinister masters of deception, using their illusions to frighten and fool others for their personal gain. "},{"name":"School of Conjuration","lvlFeatures":[2,2,6,10,14],"features":[{"name":"Conjuration Savant","description":"Beginning when you select this school at 2nd level, the gold and time you must spend to copy a conjuration spell into your spellbook is halved. "},{"name":"Minor Conjuration","description":"Starting at 2nd level when you select this school, you can use your action to conjure up an inanimate object in your hand or on the ground in an unoccupied space that you can see within 10 feet of you.\n\n    This object can be no larger than 3 feet on a side and weigh no more than 10 pounds\n    Its form must be that of a nonmagical object that you have seen.\n    The object is visibly magical, radiating dim light out to 5 feet.\n    The object disappears after 1 hour, when you use this feature again, or if it takes or deals any damage. "},{"name":"Benign Transposition","description":"Starting at 6th level, you can use your action to teleport up to 30 feet to an unoccupied space that you can see. Alternatively, you can choose a space within range that is occupied by a Small or Medium creature. If that creature is willing, you both teleport, swapping places. Once you use this feature, you can’t use it again until you finish a long rest or you cast a conjuration spell of 1st level or higher. "},{"name":"Focused Conjuration","description":"Beginning at 10th level, while you are concentrating on a conjuration spell, your concentration can’t be broken as a result of taking damage. "},{"name":"Durable Summons","description":"Starting at 14th level, any creature that you summon or create with a conjuration spell has 30 temporary hit points. "}],"description":"As a conjurer, you favor spells that produce objects and creatures out of thin air. You can conjure billowing clouds of killing fog or summon creatures from elsewhere to fight on your behalf. As your mastery grows, you learn spells of transportation and can teleport yourself across vast distances, even to other planes of existence, in an instant. "},{"name":"School of Necromancy","lvlFeatures":[2,2,6,10,14],"features":[{"name":"Necromancy Savant","description":"Beginning when you select this school at 2nd level, the gold and time you must spend to copy a necromancy spell into your spellbook is halved. "},{"name":"Grim Harvest","description":"At 2nd level, you gain the ability to reap life energy from creatures you kill with your spells. Once per turn when you kill one or more creatures with a spell of 1st level or higher, you regain hit points equal to twice the spell’s level, or three times its level if the spell belongs to the School of Necromancy. You don’t gain this benefit for killing constructs or undead. "},{"name":"Undead Thralls","description":"At 6th level, you add the animate dead spell to your spellbook if it is not there already. When you cast animate dead, you can target one additional corpse or pile of bones, creating another zombie or skeleton, as appropriate. Whenever you create an undead using a necromancy spell, it has additional benefits:\n\n    The creature’s hit point maximum is increased by an amount equal to your wizard level.\n    The creature adds your proficiency bonus to its weapon damage rolls. "},{"name":"Inured to Undeath","description":"Beginning at 10th level, you have resistance to necrotic damage, and your hit point maximum can’t be reduced. You have spent so much time dealing with undead and the forces that animate them that you have become inured to some of their worst effects. "},{"name":"Command Undead","description":"Starting at 14th level, you can use magic to bring undead under your control, even those created by other wizards. As an action, you can choose one undead that you can see within 60 feet of you. That creature must make a Charisma saving throw against your wizard spell save DC. If it succeeds, you can’t use this feature on it again. If it fails, it becomes friendly to you and obeys your commands until you use this feature again. Intelligent undead are harder to control in this way. If the target has an Intelligence of 8 or higher, it has advantage on the saving throw. If it fails the saving throw and has an Intelligence of 12 or higher, it can repeat the saving throw at the end of every hour until it succeeds and breaks free. "}],"description":"The School of Necromancy explores the cosmic forces of life, death, and undeath. As you focus your studies in this tradition, you learn to manipulate the energy that animates all living things. As you progress, you learn to sap the life force from a creature as your magic destroys its body, transforming that vital energy into magical power you can manipulate. Most people see necromancers as menacing, or even villainous, due to the close association with death. Not all necromancers are evil, but the forces they manipulate are considered taboo by many societies. "},{"name":"School of Evocation","lvlFeatures":[2,2,6,10,14],"features":[{"name":"Evocation Savant","description":"Beginning when you select this school at 2nd level, the gold and time you must spend to copy an evocation spell into your spellbook is halved. "},{"name":"Sculpt Spells","description":"Beginning at 2nd level, you can create pockets of relative safety within the effects of your evocation spells. When you cast an evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 + the spell’s level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save. "},{"name":"Potent Cantrip","description":"Starting at 6th level, your damaging cantrips affect even creatures that avoid the brunt of the effect. When a creature succeeds on a saving throw against your cantrip, the creature takes half the cantrip’s damage (if any) but suffers no additional effect from the cantrip. "},{"name":"Empowered Evocation","description":"Beginning at 10th level, you can add your Intelligence modifier to one damage roll of any wizard evocation spell you cast. "},{"name":"Overchannel","description":"Starting at 14th level, you can increase the power of your simpler spells. When you cast a wizard spell of 5th level or lower (excluding cantrips) that deals damage, you can deal maximum damage with that spell.\n\nThe first time you do so, you suffer no adverse effect. If you use this feature again before you finish a long rest, you take 2d12 necrotic damage for each level of the spell, immediately after you cast it. Each time you use this feature again before finishing a long rest, the necrotic damage per spell level increases by 1d12. This damage ignores resistance and immunity. "}],"description":"You focus your study on magic that creates powerful elemental effects such as bitter cold, searing flame, rolling thunder, crackling lightning, and burning acid. Some evokers find employment in military forces, serving as artillery to blast enemy armies from afar. Others use their spectacular power to protect the weak, While some seek their own gain as bandits, adventurers, or aspiring tyrants. "}],"hitdice":"1d6","lvlFeatures":[1,18,20],"features":[{"name":"Arcane Recovery","description":"You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher.\n\nFor example, if you’re a 4th-level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots. "},{"name":"Spell Mastery","description":"At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st level wizard spell and a 2nd level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal. By spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels. "},{"name":"Signature Spells","description":"When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don’t count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can’t do so again until you finish a short or long rest. If you want to cast either spell at a higher level, you must expend a spell slot as normal. "}]},
]
